MikroElektronika/core_packages/PIC/XC8/def/PIC16F1788/mcu.h
extern volatile PSMC3ASDSbits_t PSMC3ASDSbits __at(0xEDF);
// bitfield macros
#define _PSMC3ASDS_P3ASDSC1_POSN                            0x1
#define _PSMC3ASDS_P3ASDSC1_POSITION                        0x1
#define _PSMC3ASDS_P3ASDSC1_SIZE                            0x1
#define _PSMC3ASDS_P3ASDSC1_LENGTH                          0x1
#define _PSMC3ASDS_P3ASDSC1_MASK                            0x2
#define _PSMC3ASDS_P3ASDSC2_POSN                            0x2
#define _PSMC3ASDS_P3ASDSC2_POSITION                        0x2
#define _PSMC3ASDS_P3ASDSC2_SIZE                            0x1
#define _PSMC3ASDS_P3ASDSC2_LENGTH                          0x1
#define _PSMC3ASDS_P3ASDSC2_MASK                            0x4
#define _PSMC3ASDS_P3ASDSC3_POSN                            0x3
#define _PSMC3ASDS_P3ASDSC3_POSITION                        0x3
#define _PSMC3ASDS_P3ASDSC3_SIZE                            0x1
#define _PSMC3ASDS_P3ASDSC3_LENGTH                          0x1
#define _PSMC3ASDS_P3ASDSC3_MASK                            0x8
#define _PSMC3ASDS_P3ASDSC4_POSN                            0x4
#define _PSMC3ASDS_P3ASDSC4_POSITION                        0x4
#define _PSMC3ASDS_P3ASDSC4_SIZE                            0x1
#define _PSMC3ASDS_P3ASDSC4_LENGTH                          0x1
#define _PSMC3ASDS_P3ASDSC4_MASK                            0x10
#define _PSMC3ASDS_P3ASDSIN_POSN                            0x7
#define _PSMC3ASDS_P3ASDSIN_POSITION                        0x7
#define _PSMC3ASDS_P3ASDSIN_SIZE                            0x1
#define _PSMC3ASDS_P3ASDSIN_LENGTH                          0x1
#define _PSMC3ASDS_P3ASDSIN_MASK                            0x80

// Register: PSMC3INT
#define PSMC3INT PSMC3INT
extern volatile unsigned char           PSMC3INT            __at(0xEE0);
#ifndef _LIB_BUILD
asm("PSMC3INT equ 0EE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3TPRIF                :1;
        unsigned P3TDCIF                :1;
        unsigned P3TPHIF                :1;
        unsigned P3TOVIF                :1;
        unsigned P3TPRIE                :1;
        unsigned P3TDCIE                :1;
        unsigned P3TPHIE                :1;
        unsigned P3TOVIE                :1;
    };
} PSMC3INTbits_t;
extern volatile PSMC3INTbits_t PSMC3INTbits __at(0xEE0);
// bitfield macros
#define _PSMC3INT_P3TPRIF_POSN                              0x0
#define _PSMC3INT_P3TPRIF_POSITION                          0x0
#define _PSMC3INT_P3TPRIF_SIZE                              0x1
#define _PSMC3INT_P3TPRIF_LENGTH                            0x1
#define _PSMC3INT_P3TPRIF_MASK                              0x1
#define _PSMC3INT_P3TDCIF_POSN                              0x1
#define _PSMC3INT_P3TDCIF_POSITION                          0x1
#define _PSMC3INT_P3TDCIF_SIZE                              0x1
#define _PSMC3INT_P3TDCIF_LENGTH                            0x1
#define _PSMC3INT_P3TDCIF_MASK                              0x2
#define _PSMC3INT_P3TPHIF_POSN                              0x2
#define _PSMC3INT_P3TPHIF_POSITION                          0x2
#define _PSMC3INT_P3TPHIF_SIZE                              0x1
#define _PSMC3INT_P3TPHIF_LENGTH                            0x1
#define _PSMC3INT_P3TPHIF_MASK                              0x4
#define _PSMC3INT_P3TOVIF_POSN                              0x3
#define _PSMC3INT_P3TOVIF_POSITION                          0x3
#define _PSMC3INT_P3TOVIF_SIZE                              0x1
#define _PSMC3INT_P3TOVIF_LENGTH                            0x1
#define _PSMC3INT_P3TOVIF_MASK                              0x8
#define _PSMC3INT_P3TPRIE_POSN                              0x4
#define _PSMC3INT_P3TPRIE_POSITION                          0x4
#define _PSMC3INT_P3TPRIE_SIZE                              0x1
#define _PSMC3INT_P3TPRIE_LENGTH                            0x1
#define _PSMC3INT_P3TPRIE_MASK                              0x10
#define _PSMC3INT_P3TDCIE_POSN                              0x5
#define _PSMC3INT_P3TDCIE_POSITION                          0x5
#define _PSMC3INT_P3TDCIE_SIZE                              0x1
#define _PSMC3INT_P3TDCIE_LENGTH                            0x1
#define _PSMC3INT_P3TDCIE_MASK                              0x20
#define _PSMC3INT_P3TPHIE_POSN                              0x6
#define _PSMC3INT_P3TPHIE_POSITION                          0x6
#define _PSMC3INT_P3TPHIE_SIZE                              0x1
#define _PSMC3INT_P3TPHIE_LENGTH                            0x1
#define _PSMC3INT_P3TPHIE_MASK                              0x40
#define _PSMC3INT_P3TOVIE_POSN                              0x7
#define _PSMC3INT_P3TOVIE_POSITION                          0x7
#define _PSMC3INT_P3TOVIE_SIZE                              0x1
#define _PSMC3INT_P3TOVIE_LENGTH                            0x1
#define _PSMC3INT_P3TOVIE_MASK                              0x80

// Register: PSMC3PH
#define PSMC3PH PSMC3PH
extern volatile unsigned short          PSMC3PH             __at(0xEE1);
#ifndef _LIB_BUILD
asm("PSMC3PH equ 0EE1h");
#endif

// Register: PSMC3PHL
#define PSMC3PHL PSMC3PHL
extern volatile unsigned char           PSMC3PHL            __at(0xEE1);
#ifndef _LIB_BUILD
asm("PSMC3PHL equ 0EE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3PH0               :1;
        unsigned PSMC3PH1               :1;
        unsigned PSMC3PH2               :1;
        unsigned PSMC3PH3               :1;
        unsigned PSMC3PH4               :1;
        unsigned PSMC3PH5               :1;
        unsigned PSMC3PH6               :1;
        unsigned PSMC3PH7               :1;
    };
} PSMC3PHLbits_t;
extern volatile PSMC3PHLbits_t PSMC3PHLbits __at(0xEE1);
// bitfield macros
#define _PSMC3PHL_PSMC3PH0_POSN                             0x0
#define _PSMC3PHL_PSMC3PH0_POSITION                         0x0
#define _PSMC3PHL_PSMC3PH0_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH0_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH0_MASK                             0x1
#define _PSMC3PHL_PSMC3PH1_POSN                             0x1
#define _PSMC3PHL_PSMC3PH1_POSITION                         0x1
#define _PSMC3PHL_PSMC3PH1_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH1_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH1_MASK                             0x2
#define _PSMC3PHL_PSMC3PH2_POSN                             0x2
#define _PSMC3PHL_PSMC3PH2_POSITION                         0x2
#define _PSMC3PHL_PSMC3PH2_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH2_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH2_MASK                             0x4
#define _PSMC3PHL_PSMC3PH3_POSN                             0x3
#define _PSMC3PHL_PSMC3PH3_POSITION                         0x3
#define _PSMC3PHL_PSMC3PH3_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH3_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH3_MASK                             0x8
#define _PSMC3PHL_PSMC3PH4_POSN                             0x4
#define _PSMC3PHL_PSMC3PH4_POSITION                         0x4
#define _PSMC3PHL_PSMC3PH4_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH4_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH4_MASK                             0x10
#define _PSMC3PHL_PSMC3PH5_POSN                             0x5
#define _PSMC3PHL_PSMC3PH5_POSITION                         0x5
#define _PSMC3PHL_PSMC3PH5_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH5_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH5_MASK                             0x20
#define _PSMC3PHL_PSMC3PH6_POSN                             0x6
#define _PSMC3PHL_PSMC3PH6_POSITION                         0x6
#define _PSMC3PHL_PSMC3PH6_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH6_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH6_MASK                             0x40
#define _PSMC3PHL_PSMC3PH7_POSN                             0x7
#define _PSMC3PHL_PSMC3PH7_POSITION                         0x7
#define _PSMC3PHL_PSMC3PH7_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH7_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH7_MASK                             0x80

// Register: PSMC3PHH
#define PSMC3PHH PSMC3PHH
extern volatile unsigned char           PSMC3PHH            __at(0xEE2);
#ifndef _LIB_BUILD
asm("PSMC3PHH equ 0EE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3PH8               :1;
        unsigned PSMC3PH9               :1;
        unsigned PSMC3PH10              :1;
        unsigned PSMC3PH11              :1;
        unsigned PSMC3PH12              :1;
        unsigned PSMC3PH13              :1;
        unsigned PSMC3PH14              :1;
        unsigned PSMC3PH15              :1;
    };
} PSMC3PHHbits_t;
extern volatile PSMC3PHHbits_t PSMC3PHHbits __at(0xEE2);
// bitfield macros
#define _PSMC3PHH_PSMC3PH8_POSN                             0x0
#define _PSMC3PHH_PSMC3PH8_POSITION                         0x0
#define _PSMC3PHH_PSMC3PH8_SIZE                             0x1
#define _PSMC3PHH_PSMC3PH8_LENGTH                           0x1
#define _PSMC3PHH_PSMC3PH8_MASK                             0x1
#define _PSMC3PHH_PSMC3PH9_POSN                             0x1
#define _PSMC3PHH_PSMC3PH9_POSITION                         0x1
#define _PSMC3PHH_PSMC3PH9_SIZE                             0x1
#define _PSMC3PHH_PSMC3PH9_LENGTH                           0x1
#define _PSMC3PHH_PSMC3PH9_MASK                             0x2
#define _PSMC3PHH_PSMC3PH10_POSN                            0x2
#define _PSMC3PHH_PSMC3PH10_POSITION                        0x2
#define _PSMC3PHH_PSMC3PH10_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH10_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH10_MASK                            0x4
#define _PSMC3PHH_PSMC3PH11_POSN                            0x3
#define _PSMC3PHH_PSMC3PH11_POSITION                        0x3
#define _PSMC3PHH_PSMC3PH11_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH11_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH11_MASK                            0x8
#define _PSMC3PHH_PSMC3PH12_POSN                            0x4
#define _PSMC3PHH_PSMC3PH12_POSITION                        0x4
#define _PSMC3PHH_PSMC3PH12_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH12_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH12_MASK                            0x10
#define _PSMC3PHH_PSMC3PH13_POSN                            0x5
#define _PSMC3PHH_PSMC3PH13_POSITION                        0x5
#define _PSMC3PHH_PSMC3PH13_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH13_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH13_MASK                            0x20
#define _PSMC3PHH_PSMC3PH14_POSN                            0x6
#define _PSMC3PHH_PSMC3PH14_POSITION                        0x6
#define _PSMC3PHH_PSMC3PH14_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH14_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH14_MASK                            0x40
#define _PSMC3PHH_PSMC3PH15_POSN                            0x7
#define _PSMC3PHH_PSMC3PH15_POSITION                        0x7
#define _PSMC3PHH_PSMC3PH15_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH15_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH15_MASK                            0x80

// Register: PSMC3DC
#define PSMC3DC PSMC3DC
extern volatile unsigned short          PSMC3DC             __at(0xEE3);
#ifndef _LIB_BUILD
asm("PSMC3DC equ 0EE3h");
#endif

// Register: PSMC3DCL
#define PSMC3DCL PSMC3DCL
extern volatile unsigned char           PSMC3DCL            __at(0xEE3);
#ifndef _LIB_BUILD
asm("PSMC3DCL equ 0EE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3DC0               :1;
        unsigned PSMC3DC1               :1;
        unsigned PSMC3DC2               :1;
        unsigned PSMC3DC3               :1;
        unsigned PSMC3DC4               :1;
        unsigned PSMC3DC5               :1;
        unsigned PSMC3DC6               :1;
        unsigned PSMC3DC7               :1;
    };
} PSMC3DCLbits_t;
extern volatile PSMC3DCLbits_t PSMC3DCLbits __at(0xEE3);
// bitfield macros
#define _PSMC3DCL_PSMC3DC0_POSN                             0x0
#define _PSMC3DCL_PSMC3DC0_POSITION                         0x0
#define _PSMC3DCL_PSMC3DC0_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC0_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC0_MASK                             0x1
#define _PSMC3DCL_PSMC3DC1_POSN                             0x1
#define _PSMC3DCL_PSMC3DC1_POSITION                         0x1
#define _PSMC3DCL_PSMC3DC1_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC1_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC1_MASK                             0x2
#define _PSMC3DCL_PSMC3DC2_POSN                             0x2
#define _PSMC3DCL_PSMC3DC2_POSITION                         0x2
#define _PSMC3DCL_PSMC3DC2_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC2_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC2_MASK                             0x4
#define _PSMC3DCL_PSMC3DC3_POSN                             0x3
#define _PSMC3DCL_PSMC3DC3_POSITION                         0x3
#define _PSMC3DCL_PSMC3DC3_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC3_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC3_MASK                             0x8
#define _PSMC3DCL_PSMC3DC4_POSN                             0x4
#define _PSMC3DCL_PSMC3DC4_POSITION                         0x4
#define _PSMC3DCL_PSMC3DC4_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC4_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC4_MASK                             0x10
#define _PSMC3DCL_PSMC3DC5_POSN                             0x5
#define _PSMC3DCL_PSMC3DC5_POSITION                         0x5
#define _PSMC3DCL_PSMC3DC5_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC5_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC5_MASK                             0x20
#define _PSMC3DCL_PSMC3DC6_POSN                             0x6
#define _PSMC3DCL_PSMC3DC6_POSITION                         0x6
#define _PSMC3DCL_PSMC3DC6_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC6_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC6_MASK                             0x40
#define _PSMC3DCL_PSMC3DC7_POSN                             0x7
#define _PSMC3DCL_PSMC3DC7_POSITION                         0x7
#define _PSMC3DCL_PSMC3DC7_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC7_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC7_MASK                             0x80

