MikroElektronika/core_packages/PIC/XC8/def/PIC16F1788/mcu.h
extern volatile PSMC4FEBSbits_t PSMC4FEBSbits __at(0xF19);
// bitfield macros
#define _PSMC4FEBS_P4FEBSC1_POSN                            0x1
#define _PSMC4FEBS_P4FEBSC1_POSITION                        0x1
#define _PSMC4FEBS_P4FEBSC1_SIZE                            0x1
#define _PSMC4FEBS_P4FEBSC1_LENGTH                          0x1
#define _PSMC4FEBS_P4FEBSC1_MASK                            0x2
#define _PSMC4FEBS_P4FEBSC2_POSN                            0x2
#define _PSMC4FEBS_P4FEBSC2_POSITION                        0x2
#define _PSMC4FEBS_P4FEBSC2_SIZE                            0x1
#define _PSMC4FEBS_P4FEBSC2_LENGTH                          0x1
#define _PSMC4FEBS_P4FEBSC2_MASK                            0x4
#define _PSMC4FEBS_P4FEBSC3_POSN                            0x3
#define _PSMC4FEBS_P4FEBSC3_POSITION                        0x3
#define _PSMC4FEBS_P4FEBSC3_SIZE                            0x1
#define _PSMC4FEBS_P4FEBSC3_LENGTH                          0x1
#define _PSMC4FEBS_P4FEBSC3_MASK                            0x8
#define _PSMC4FEBS_P4FEBSC4_POSN                            0x4
#define _PSMC4FEBS_P4FEBSC4_POSITION                        0x4
#define _PSMC4FEBS_P4FEBSC4_SIZE                            0x1
#define _PSMC4FEBS_P4FEBSC4_LENGTH                          0x1
#define _PSMC4FEBS_P4FEBSC4_MASK                            0x10
#define _PSMC4FEBS_P4FEBSIN_POSN                            0x7
#define _PSMC4FEBS_P4FEBSIN_POSITION                        0x7
#define _PSMC4FEBS_P4FEBSIN_SIZE                            0x1
#define _PSMC4FEBS_P4FEBSIN_LENGTH                          0x1
#define _PSMC4FEBS_P4FEBSIN_MASK                            0x80

// Register: PSMC4PHS
#define PSMC4PHS PSMC4PHS
extern volatile unsigned char           PSMC4PHS            __at(0xF1A);
#ifndef _LIB_BUILD
asm("PSMC4PHS equ 0F1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4PHST                 :1;
        unsigned P4PHSC1                :1;
        unsigned P4PHSC2                :1;
        unsigned P4PHSC3                :1;
        unsigned P4PHSC4                :1;
        unsigned                        :2;
        unsigned P4PHSIN                :1;
    };
} PSMC4PHSbits_t;
extern volatile PSMC4PHSbits_t PSMC4PHSbits __at(0xF1A);
// bitfield macros
#define _PSMC4PHS_P4PHST_POSN                               0x0
#define _PSMC4PHS_P4PHST_POSITION                           0x0
#define _PSMC4PHS_P4PHST_SIZE                               0x1
#define _PSMC4PHS_P4PHST_LENGTH                             0x1
#define _PSMC4PHS_P4PHST_MASK                               0x1
#define _PSMC4PHS_P4PHSC1_POSN                              0x1
#define _PSMC4PHS_P4PHSC1_POSITION                          0x1
#define _PSMC4PHS_P4PHSC1_SIZE                              0x1
#define _PSMC4PHS_P4PHSC1_LENGTH                            0x1
#define _PSMC4PHS_P4PHSC1_MASK                              0x2
#define _PSMC4PHS_P4PHSC2_POSN                              0x2
#define _PSMC4PHS_P4PHSC2_POSITION                          0x2
#define _PSMC4PHS_P4PHSC2_SIZE                              0x1
#define _PSMC4PHS_P4PHSC2_LENGTH                            0x1
#define _PSMC4PHS_P4PHSC2_MASK                              0x4
#define _PSMC4PHS_P4PHSC3_POSN                              0x3
#define _PSMC4PHS_P4PHSC3_POSITION                          0x3
#define _PSMC4PHS_P4PHSC3_SIZE                              0x1
#define _PSMC4PHS_P4PHSC3_LENGTH                            0x1
#define _PSMC4PHS_P4PHSC3_MASK                              0x8
#define _PSMC4PHS_P4PHSC4_POSN                              0x4
#define _PSMC4PHS_P4PHSC4_POSITION                          0x4
#define _PSMC4PHS_P4PHSC4_SIZE                              0x1
#define _PSMC4PHS_P4PHSC4_LENGTH                            0x1
#define _PSMC4PHS_P4PHSC4_MASK                              0x10
#define _PSMC4PHS_P4PHSIN_POSN                              0x7
#define _PSMC4PHS_P4PHSIN_POSITION                          0x7
#define _PSMC4PHS_P4PHSIN_SIZE                              0x1
#define _PSMC4PHS_P4PHSIN_LENGTH                            0x1
#define _PSMC4PHS_P4PHSIN_MASK                              0x80

// Register: PSMC4DCS
#define PSMC4DCS PSMC4DCS
extern volatile unsigned char           PSMC4DCS            __at(0xF1B);
#ifndef _LIB_BUILD
asm("PSMC4DCS equ 0F1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4DCST                 :1;
        unsigned P4DCSC1                :1;
        unsigned P4DCSC2                :1;
        unsigned P4DCSC3                :1;
        unsigned P4DCSC4                :1;
        unsigned                        :2;
        unsigned P4DCSIN                :1;
    };
} PSMC4DCSbits_t;
extern volatile PSMC4DCSbits_t PSMC4DCSbits __at(0xF1B);
// bitfield macros
#define _PSMC4DCS_P4DCST_POSN                               0x0
#define _PSMC4DCS_P4DCST_POSITION                           0x0
#define _PSMC4DCS_P4DCST_SIZE                               0x1
#define _PSMC4DCS_P4DCST_LENGTH                             0x1
#define _PSMC4DCS_P4DCST_MASK                               0x1
#define _PSMC4DCS_P4DCSC1_POSN                              0x1
#define _PSMC4DCS_P4DCSC1_POSITION                          0x1
#define _PSMC4DCS_P4DCSC1_SIZE                              0x1
#define _PSMC4DCS_P4DCSC1_LENGTH                            0x1
#define _PSMC4DCS_P4DCSC1_MASK                              0x2
#define _PSMC4DCS_P4DCSC2_POSN                              0x2
#define _PSMC4DCS_P4DCSC2_POSITION                          0x2
#define _PSMC4DCS_P4DCSC2_SIZE                              0x1
#define _PSMC4DCS_P4DCSC2_LENGTH                            0x1
#define _PSMC4DCS_P4DCSC2_MASK                              0x4
#define _PSMC4DCS_P4DCSC3_POSN                              0x3
#define _PSMC4DCS_P4DCSC3_POSITION                          0x3
#define _PSMC4DCS_P4DCSC3_SIZE                              0x1
#define _PSMC4DCS_P4DCSC3_LENGTH                            0x1
#define _PSMC4DCS_P4DCSC3_MASK                              0x8
#define _PSMC4DCS_P4DCSC4_POSN                              0x4
#define _PSMC4DCS_P4DCSC4_POSITION                          0x4
#define _PSMC4DCS_P4DCSC4_SIZE                              0x1
#define _PSMC4DCS_P4DCSC4_LENGTH                            0x1
#define _PSMC4DCS_P4DCSC4_MASK                              0x10
#define _PSMC4DCS_P4DCSIN_POSN                              0x7
#define _PSMC4DCS_P4DCSIN_POSITION                          0x7
#define _PSMC4DCS_P4DCSIN_SIZE                              0x1
#define _PSMC4DCS_P4DCSIN_LENGTH                            0x1
#define _PSMC4DCS_P4DCSIN_MASK                              0x80

// Register: PSMC4PRS
#define PSMC4PRS PSMC4PRS
extern volatile unsigned char           PSMC4PRS            __at(0xF1C);
#ifndef _LIB_BUILD
asm("PSMC4PRS equ 0F1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4PRST                 :1;
        unsigned P4PRSC1                :1;
        unsigned P4PRSC2                :1;
        unsigned P4PRSC3                :1;
        unsigned P4PRSC4                :1;
        unsigned                        :2;
        unsigned P4PRSIN                :1;
    };
} PSMC4PRSbits_t;
extern volatile PSMC4PRSbits_t PSMC4PRSbits __at(0xF1C);
// bitfield macros
#define _PSMC4PRS_P4PRST_POSN                               0x0
#define _PSMC4PRS_P4PRST_POSITION                           0x0
#define _PSMC4PRS_P4PRST_SIZE                               0x1
#define _PSMC4PRS_P4PRST_LENGTH                             0x1
#define _PSMC4PRS_P4PRST_MASK                               0x1
#define _PSMC4PRS_P4PRSC1_POSN                              0x1
#define _PSMC4PRS_P4PRSC1_POSITION                          0x1
#define _PSMC4PRS_P4PRSC1_SIZE                              0x1
#define _PSMC4PRS_P4PRSC1_LENGTH                            0x1
#define _PSMC4PRS_P4PRSC1_MASK                              0x2
#define _PSMC4PRS_P4PRSC2_POSN                              0x2
#define _PSMC4PRS_P4PRSC2_POSITION                          0x2
#define _PSMC4PRS_P4PRSC2_SIZE                              0x1
#define _PSMC4PRS_P4PRSC2_LENGTH                            0x1
#define _PSMC4PRS_P4PRSC2_MASK                              0x4
#define _PSMC4PRS_P4PRSC3_POSN                              0x3
#define _PSMC4PRS_P4PRSC3_POSITION                          0x3
#define _PSMC4PRS_P4PRSC3_SIZE                              0x1
#define _PSMC4PRS_P4PRSC3_LENGTH                            0x1
#define _PSMC4PRS_P4PRSC3_MASK                              0x8
#define _PSMC4PRS_P4PRSC4_POSN                              0x4
#define _PSMC4PRS_P4PRSC4_POSITION                          0x4
#define _PSMC4PRS_P4PRSC4_SIZE                              0x1
#define _PSMC4PRS_P4PRSC4_LENGTH                            0x1
#define _PSMC4PRS_P4PRSC4_MASK                              0x10
#define _PSMC4PRS_P4PRSIN_POSN                              0x7
#define _PSMC4PRS_P4PRSIN_POSITION                          0x7
#define _PSMC4PRS_P4PRSIN_SIZE                              0x1
#define _PSMC4PRS_P4PRSIN_LENGTH                            0x1
#define _PSMC4PRS_P4PRSIN_MASK                              0x80

// Register: PSMC4ASDC
#define PSMC4ASDC PSMC4ASDC
extern volatile unsigned char           PSMC4ASDC           __at(0xF1D);
#ifndef _LIB_BUILD
asm("PSMC4ASDC equ 0F1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4ASDOV                :1;
        unsigned                        :4;
        unsigned P4ARSEN                :1;
        unsigned P4ASDEN                :1;
        unsigned P4ASE                  :1;
    };
} PSMC4ASDCbits_t;
extern volatile PSMC4ASDCbits_t PSMC4ASDCbits __at(0xF1D);
// bitfield macros
#define _PSMC4ASDC_P4ASDOV_POSN                             0x0
#define _PSMC4ASDC_P4ASDOV_POSITION                         0x0
#define _PSMC4ASDC_P4ASDOV_SIZE                             0x1
#define _PSMC4ASDC_P4ASDOV_LENGTH                           0x1
#define _PSMC4ASDC_P4ASDOV_MASK                             0x1
#define _PSMC4ASDC_P4ARSEN_POSN                             0x5
#define _PSMC4ASDC_P4ARSEN_POSITION                         0x5
#define _PSMC4ASDC_P4ARSEN_SIZE                             0x1
#define _PSMC4ASDC_P4ARSEN_LENGTH                           0x1
#define _PSMC4ASDC_P4ARSEN_MASK                             0x20
#define _PSMC4ASDC_P4ASDEN_POSN                             0x6
#define _PSMC4ASDC_P4ASDEN_POSITION                         0x6
#define _PSMC4ASDC_P4ASDEN_SIZE                             0x1
#define _PSMC4ASDC_P4ASDEN_LENGTH                           0x1
#define _PSMC4ASDC_P4ASDEN_MASK                             0x40
#define _PSMC4ASDC_P4ASE_POSN                               0x7
#define _PSMC4ASDC_P4ASE_POSITION                           0x7
#define _PSMC4ASDC_P4ASE_SIZE                               0x1
#define _PSMC4ASDC_P4ASE_LENGTH                             0x1
#define _PSMC4ASDC_P4ASE_MASK                               0x80

// Register: PSMC4ASDL
#define PSMC4ASDL PSMC4ASDL
extern volatile unsigned char           PSMC4ASDL           __at(0xF1E);
#ifndef _LIB_BUILD
asm("PSMC4ASDL equ 0F1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4ASDLA                :1;
        unsigned P4ASDLB                :1;
    };
} PSMC4ASDLbits_t;
extern volatile PSMC4ASDLbits_t PSMC4ASDLbits __at(0xF1E);
// bitfield macros
#define _PSMC4ASDL_P4ASDLA_POSN                             0x0
#define _PSMC4ASDL_P4ASDLA_POSITION                         0x0
#define _PSMC4ASDL_P4ASDLA_SIZE                             0x1
#define _PSMC4ASDL_P4ASDLA_LENGTH                           0x1
#define _PSMC4ASDL_P4ASDLA_MASK                             0x1
#define _PSMC4ASDL_P4ASDLB_POSN                             0x1
#define _PSMC4ASDL_P4ASDLB_POSITION                         0x1
#define _PSMC4ASDL_P4ASDLB_SIZE                             0x1
#define _PSMC4ASDL_P4ASDLB_LENGTH                           0x1
#define _PSMC4ASDL_P4ASDLB_MASK                             0x2

// Register: PSMC4ASDS
#define PSMC4ASDS PSMC4ASDS
extern volatile unsigned char           PSMC4ASDS           __at(0xF1F);
#ifndef _LIB_BUILD
asm("PSMC4ASDS equ 0F1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P4ASDSC1               :1;
        unsigned P4ASDSC2               :1;
        unsigned P4ASDSC3               :1;
        unsigned P4ASDSC4               :1;
        unsigned                        :2;
        unsigned P4ASDSIN               :1;
    };
} PSMC4ASDSbits_t;
extern volatile PSMC4ASDSbits_t PSMC4ASDSbits __at(0xF1F);
// bitfield macros
#define _PSMC4ASDS_P4ASDSC1_POSN                            0x1
#define _PSMC4ASDS_P4ASDSC1_POSITION                        0x1
#define _PSMC4ASDS_P4ASDSC1_SIZE                            0x1
#define _PSMC4ASDS_P4ASDSC1_LENGTH                          0x1
#define _PSMC4ASDS_P4ASDSC1_MASK                            0x2
#define _PSMC4ASDS_P4ASDSC2_POSN                            0x2
#define _PSMC4ASDS_P4ASDSC2_POSITION                        0x2
#define _PSMC4ASDS_P4ASDSC2_SIZE                            0x1
#define _PSMC4ASDS_P4ASDSC2_LENGTH                          0x1
#define _PSMC4ASDS_P4ASDSC2_MASK                            0x4
#define _PSMC4ASDS_P4ASDSC3_POSN                            0x3
#define _PSMC4ASDS_P4ASDSC3_POSITION                        0x3
#define _PSMC4ASDS_P4ASDSC3_SIZE                            0x1
#define _PSMC4ASDS_P4ASDSC3_LENGTH                          0x1
#define _PSMC4ASDS_P4ASDSC3_MASK                            0x8
#define _PSMC4ASDS_P4ASDSC4_POSN                            0x4
#define _PSMC4ASDS_P4ASDSC4_POSITION                        0x4
#define _PSMC4ASDS_P4ASDSC4_SIZE                            0x1
#define _PSMC4ASDS_P4ASDSC4_LENGTH                          0x1
#define _PSMC4ASDS_P4ASDSC4_MASK                            0x10
#define _PSMC4ASDS_P4ASDSIN_POSN                            0x7
#define _PSMC4ASDS_P4ASDSIN_POSITION                        0x7
#define _PSMC4ASDS_P4ASDSIN_SIZE                            0x1
#define _PSMC4ASDS_P4ASDSIN_LENGTH                          0x1
#define _PSMC4ASDS_P4ASDSIN_MASK                            0x80

