MikroElektronika/core_packages/PIC/XC8/def/PIC16F1788/mcu.h
// Register: PSMC4INT
#define PSMC4INT PSMC4INT
extern volatile unsigned char           PSMC4INT            __at(0xF20);
#ifndef _LIB_BUILD
asm("PSMC4INT equ 0F20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4TPRIF                :1;
        unsigned P4TDCIF                :1;
        unsigned P4TPHIF                :1;
        unsigned P4TOVIF                :1;
        unsigned P4TPRIE                :1;
        unsigned P4TDCIE                :1;
        unsigned P4TPHIE                :1;
        unsigned P4TOVIE                :1;
    };
} PSMC4INTbits_t;
extern volatile PSMC4INTbits_t PSMC4INTbits __at(0xF20);
// bitfield macros
#define _PSMC4INT_P4TPRIF_POSN                              0x0
#define _PSMC4INT_P4TPRIF_POSITION                          0x0
#define _PSMC4INT_P4TPRIF_SIZE                              0x1
#define _PSMC4INT_P4TPRIF_LENGTH                            0x1
#define _PSMC4INT_P4TPRIF_MASK                              0x1
#define _PSMC4INT_P4TDCIF_POSN                              0x1
#define _PSMC4INT_P4TDCIF_POSITION                          0x1
#define _PSMC4INT_P4TDCIF_SIZE                              0x1
#define _PSMC4INT_P4TDCIF_LENGTH                            0x1
#define _PSMC4INT_P4TDCIF_MASK                              0x2
#define _PSMC4INT_P4TPHIF_POSN                              0x2
#define _PSMC4INT_P4TPHIF_POSITION                          0x2
#define _PSMC4INT_P4TPHIF_SIZE                              0x1
#define _PSMC4INT_P4TPHIF_LENGTH                            0x1
#define _PSMC4INT_P4TPHIF_MASK                              0x4
#define _PSMC4INT_P4TOVIF_POSN                              0x3
#define _PSMC4INT_P4TOVIF_POSITION                          0x3
#define _PSMC4INT_P4TOVIF_SIZE                              0x1
#define _PSMC4INT_P4TOVIF_LENGTH                            0x1
#define _PSMC4INT_P4TOVIF_MASK                              0x8
#define _PSMC4INT_P4TPRIE_POSN                              0x4
#define _PSMC4INT_P4TPRIE_POSITION                          0x4
#define _PSMC4INT_P4TPRIE_SIZE                              0x1
#define _PSMC4INT_P4TPRIE_LENGTH                            0x1
#define _PSMC4INT_P4TPRIE_MASK                              0x10
#define _PSMC4INT_P4TDCIE_POSN                              0x5
#define _PSMC4INT_P4TDCIE_POSITION                          0x5
#define _PSMC4INT_P4TDCIE_SIZE                              0x1
#define _PSMC4INT_P4TDCIE_LENGTH                            0x1
#define _PSMC4INT_P4TDCIE_MASK                              0x20
#define _PSMC4INT_P4TPHIE_POSN                              0x6
#define _PSMC4INT_P4TPHIE_POSITION                          0x6
#define _PSMC4INT_P4TPHIE_SIZE                              0x1
#define _PSMC4INT_P4TPHIE_LENGTH                            0x1
#define _PSMC4INT_P4TPHIE_MASK                              0x40
#define _PSMC4INT_P4TOVIE_POSN                              0x7
#define _PSMC4INT_P4TOVIE_POSITION                          0x7
#define _PSMC4INT_P4TOVIE_SIZE                              0x1
#define _PSMC4INT_P4TOVIE_LENGTH                            0x1
#define _PSMC4INT_P4TOVIE_MASK                              0x80

// Register: PSMC4PH
#define PSMC4PH PSMC4PH
extern volatile unsigned short          PSMC4PH             __at(0xF21);
#ifndef _LIB_BUILD
asm("PSMC4PH equ 0F21h");
#endif

// Register: PSMC4PHL
#define PSMC4PHL PSMC4PHL
extern volatile unsigned char           PSMC4PHL            __at(0xF21);
#ifndef _LIB_BUILD
asm("PSMC4PHL equ 0F21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4PH0               :1;
        unsigned PSMC4PH1               :1;
        unsigned PSMC4PH2               :1;
        unsigned PSMC4PH3               :1;
        unsigned PSMC4PH4               :1;
        unsigned PSMC4PH5               :1;
        unsigned PSMC4PH6               :1;
        unsigned PSMC4PH7               :1;
    };
} PSMC4PHLbits_t;
extern volatile PSMC4PHLbits_t PSMC4PHLbits __at(0xF21);
// bitfield macros
#define _PSMC4PHL_PSMC4PH0_POSN                             0x0
#define _PSMC4PHL_PSMC4PH0_POSITION                         0x0
#define _PSMC4PHL_PSMC4PH0_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH0_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH0_MASK                             0x1
#define _PSMC4PHL_PSMC4PH1_POSN                             0x1
#define _PSMC4PHL_PSMC4PH1_POSITION                         0x1
#define _PSMC4PHL_PSMC4PH1_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH1_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH1_MASK                             0x2
#define _PSMC4PHL_PSMC4PH2_POSN                             0x2
#define _PSMC4PHL_PSMC4PH2_POSITION                         0x2
#define _PSMC4PHL_PSMC4PH2_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH2_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH2_MASK                             0x4
#define _PSMC4PHL_PSMC4PH3_POSN                             0x3
#define _PSMC4PHL_PSMC4PH3_POSITION                         0x3
#define _PSMC4PHL_PSMC4PH3_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH3_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH3_MASK                             0x8
#define _PSMC4PHL_PSMC4PH4_POSN                             0x4
#define _PSMC4PHL_PSMC4PH4_POSITION                         0x4
#define _PSMC4PHL_PSMC4PH4_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH4_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH4_MASK                             0x10
#define _PSMC4PHL_PSMC4PH5_POSN                             0x5
#define _PSMC4PHL_PSMC4PH5_POSITION                         0x5
#define _PSMC4PHL_PSMC4PH5_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH5_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH5_MASK                             0x20
#define _PSMC4PHL_PSMC4PH6_POSN                             0x6
#define _PSMC4PHL_PSMC4PH6_POSITION                         0x6
#define _PSMC4PHL_PSMC4PH6_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH6_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH6_MASK                             0x40
#define _PSMC4PHL_PSMC4PH7_POSN                             0x7
#define _PSMC4PHL_PSMC4PH7_POSITION                         0x7
#define _PSMC4PHL_PSMC4PH7_SIZE                             0x1
#define _PSMC4PHL_PSMC4PH7_LENGTH                           0x1
#define _PSMC4PHL_PSMC4PH7_MASK                             0x80

// Register: PSMC4PHH
#define PSMC4PHH PSMC4PHH
extern volatile unsigned char           PSMC4PHH            __at(0xF22);
#ifndef _LIB_BUILD
asm("PSMC4PHH equ 0F22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4PH8               :1;
        unsigned PSMC4PH9               :1;
        unsigned PSMC4PH10              :1;
        unsigned PSMC4PH11              :1;
        unsigned PSMC4PH12              :1;
        unsigned PSMC4PH13              :1;
        unsigned PSMC4PH14              :1;
        unsigned PSMC4PH15              :1;
    };
} PSMC4PHHbits_t;
extern volatile PSMC4PHHbits_t PSMC4PHHbits __at(0xF22);
// bitfield macros
#define _PSMC4PHH_PSMC4PH8_POSN                             0x0
#define _PSMC4PHH_PSMC4PH8_POSITION                         0x0
#define _PSMC4PHH_PSMC4PH8_SIZE                             0x1
#define _PSMC4PHH_PSMC4PH8_LENGTH                           0x1
#define _PSMC4PHH_PSMC4PH8_MASK                             0x1
#define _PSMC4PHH_PSMC4PH9_POSN                             0x1
#define _PSMC4PHH_PSMC4PH9_POSITION                         0x1
#define _PSMC4PHH_PSMC4PH9_SIZE                             0x1
#define _PSMC4PHH_PSMC4PH9_LENGTH                           0x1
#define _PSMC4PHH_PSMC4PH9_MASK                             0x2
#define _PSMC4PHH_PSMC4PH10_POSN                            0x2
#define _PSMC4PHH_PSMC4PH10_POSITION                        0x2
#define _PSMC4PHH_PSMC4PH10_SIZE                            0x1
#define _PSMC4PHH_PSMC4PH10_LENGTH                          0x1
#define _PSMC4PHH_PSMC4PH10_MASK                            0x4
#define _PSMC4PHH_PSMC4PH11_POSN                            0x3
#define _PSMC4PHH_PSMC4PH11_POSITION                        0x3
#define _PSMC4PHH_PSMC4PH11_SIZE                            0x1
#define _PSMC4PHH_PSMC4PH11_LENGTH                          0x1
#define _PSMC4PHH_PSMC4PH11_MASK                            0x8
#define _PSMC4PHH_PSMC4PH12_POSN                            0x4
#define _PSMC4PHH_PSMC4PH12_POSITION                        0x4
#define _PSMC4PHH_PSMC4PH12_SIZE                            0x1
#define _PSMC4PHH_PSMC4PH12_LENGTH                          0x1
#define _PSMC4PHH_PSMC4PH12_MASK                            0x10
#define _PSMC4PHH_PSMC4PH13_POSN                            0x5
#define _PSMC4PHH_PSMC4PH13_POSITION                        0x5
#define _PSMC4PHH_PSMC4PH13_SIZE                            0x1
#define _PSMC4PHH_PSMC4PH13_LENGTH                          0x1
#define _PSMC4PHH_PSMC4PH13_MASK                            0x20
#define _PSMC4PHH_PSMC4PH14_POSN                            0x6
#define _PSMC4PHH_PSMC4PH14_POSITION                        0x6
#define _PSMC4PHH_PSMC4PH14_SIZE                            0x1
#define _PSMC4PHH_PSMC4PH14_LENGTH                          0x1
#define _PSMC4PHH_PSMC4PH14_MASK                            0x40
#define _PSMC4PHH_PSMC4PH15_POSN                            0x7
#define _PSMC4PHH_PSMC4PH15_POSITION                        0x7
#define _PSMC4PHH_PSMC4PH15_SIZE                            0x1
#define _PSMC4PHH_PSMC4PH15_LENGTH                          0x1
#define _PSMC4PHH_PSMC4PH15_MASK                            0x80

