MikroElektronika/core_packages/PIC/XC8/def/PIC16F1788/mcu.h
#define                                 C3PCH1_bit          _BIT_ACCESS(CM3CON1,4)
// CM3CON1<C3PCH2>
extern volatile __bit                   C3PCH2              __at(0x8FD);	// @ (0x11F * 8 + 5)
#define                                 C3PCH2_bit          _BIT_ACCESS(CM3CON1,5)
// CM3CON0<C3POL>
extern volatile __bit                   C3POL               __at(0x8F4);	// @ (0x11E * 8 + 4)
#define                                 C3POL_bit           _BIT_ACCESS(CM3CON0,4)
// CM3CON0<C3SP>
extern volatile __bit                   C3SP                __at(0x8F2);	// @ (0x11E * 8 + 2)
#define                                 C3SP_bit            _BIT_ACCESS(CM3CON0,2)
// CM3CON0<C3SYNC>
extern volatile __bit                   C3SYNC              __at(0x8F0);	// @ (0x11E * 8 + 0)
#define                                 C3SYNC_bit          _BIT_ACCESS(CM3CON0,0)
// CM3CON0<C3ZLF>
extern volatile __bit                   C3ZLF               __at(0x8F3);	// @ (0x11E * 8 + 3)
#define                                 C3ZLF_bit           _BIT_ACCESS(CM3CON0,3)
// CM4CON0<C4HYS>
extern volatile __bit                   C4HYS               __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 C4HYS_bit           _BIT_ACCESS(CM4CON0,1)
// PIE2<C4IE>
extern volatile __bit                   C4IE                __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 C4IE_bit            _BIT_ACCESS(PIE2,2)
// PIR2<C4IF>
extern volatile __bit                   C4IF                __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 C4IF_bit            _BIT_ACCESS(PIR2,2)
// CM4CON1<C4INTN>
extern volatile __bit                   C4INTN              __at(0x8DE);	// @ (0x11B * 8 + 6)
#define                                 C4INTN_bit          _BIT_ACCESS(CM4CON1,6)
// CM4CON1<C4INTP>
extern volatile __bit                   C4INTP              __at(0x8DF);	// @ (0x11B * 8 + 7)
#define                                 C4INTP_bit          _BIT_ACCESS(CM4CON1,7)
// CM4CON1<C4NCH0>
extern volatile __bit                   C4NCH0              __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 C4NCH0_bit          _BIT_ACCESS(CM4CON1,0)
// CM4CON1<C4NCH1>
extern volatile __bit                   C4NCH1              __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 C4NCH1_bit          _BIT_ACCESS(CM4CON1,1)
// CM4CON1<C4NCH2>
extern volatile __bit                   C4NCH2              __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 C4NCH2_bit          _BIT_ACCESS(CM4CON1,2)
// CM4CON0<C4OE>
extern volatile __bit                   C4OE                __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 C4OE_bit            _BIT_ACCESS(CM4CON0,5)
// CM4CON0<C4ON>
extern volatile __bit                   C4ON                __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 C4ON_bit            _BIT_ACCESS(CM4CON0,7)
// CM4CON0<C4OUT>
extern volatile __bit                   C4OUT               __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 C4OUT_bit           _BIT_ACCESS(CM4CON0,6)
// CM4CON1<C4PCH0>
extern volatile __bit                   C4PCH0              __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 C4PCH0_bit          _BIT_ACCESS(CM4CON1,3)
// CM4CON1<C4PCH1>
extern volatile __bit                   C4PCH1              __at(0x8DC);	// @ (0x11B * 8 + 4)
#define                                 C4PCH1_bit          _BIT_ACCESS(CM4CON1,4)
// CM4CON1<C4PCH2>
extern volatile __bit                   C4PCH2              __at(0x8DD);	// @ (0x11B * 8 + 5)
#define                                 C4PCH2_bit          _BIT_ACCESS(CM4CON1,5)
// CM4CON0<C4POL>
extern volatile __bit                   C4POL               __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 C4POL_bit           _BIT_ACCESS(CM4CON0,4)
// CM4CON0<C4SP>
extern volatile __bit                   C4SP                __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 C4SP_bit            _BIT_ACCESS(CM4CON0,2)
// CM4CON0<C4SYNC>
extern volatile __bit                   C4SYNC              __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 C4SYNC_bit          _BIT_ACCESS(CM4CON0,0)
// CM4CON0<C4ZLF>
extern volatile __bit                   C4ZLF               __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 C4ZLF_bit           _BIT_ACCESS(CM4CON0,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// APFCON1<CCP1SEL>
extern volatile __bit                   CCP1SEL             __at(0x8EE);	// @ (0x11D * 8 + 6)
#define                                 CCP1SEL_bit         _BIT_ACCESS(APFCON1,6)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// APFCON1<CCP2SEL>
extern volatile __bit                   CCP2SEL             __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 CCP2SEL_bit         _BIT_ACCESS(APFCON1,0)
// PIE3<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x49C);	// @ (0x93 * 8 + 4)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x9C);	// @ (0x13 * 8 + 4)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR3,4)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x189B);	// @ (0x313 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// APFCON2<CCP3SEL>
extern volatile __bit                   CCP3SEL             __at(0x8E0);	// @ (0x11C * 8 + 0)
#define                                 CCP3SEL_bit         _BIT_ACCESS(APFCON2,0)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// ADCON2<CHSN0>
extern volatile __bit                   CHSN0               __at(0x4F8);	// @ (0x9F * 8 + 0)
#define                                 CHSN0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<CHSN1>
extern volatile __bit                   CHSN1               __at(0x4F9);	// @ (0x9F * 8 + 1)
#define                                 CHSN1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<CHSN2>
extern volatile __bit                   CHSN2               __at(0x4FA);	// @ (0x9F * 8 + 2)
#define                                 CHSN2_bit           _BIT_ACCESS(ADCON2,2)
// ADCON2<CHSN3>
extern volatile __bit                   CHSN3               __at(0x4FB);	// @ (0x9F * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON2,3)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x28D3);	// @ (0x51A * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x28D4);	// @ (0x51A * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x28D0);	// @ (0x51A * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x28D1);	// @ (0x51A * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x28D2);	// @ (0x51A * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x28D7);	// @ (0x51A * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// CLKRCON<CLKROE>
extern volatile __bit                   CLKROE              __at(0x28D6);	// @ (0x51A * 8 + 6)
#define                                 CLKROE_bit          _BIT_ACCESS(CLKRCON,6)
// CLKRCON<CLKRSLR>
extern volatile __bit                   CLKRSLR             __at(0x28D5);	// @ (0x51A * 8 + 5)
#define                                 CLKRSLR_bit         _BIT_ACCESS(CLKRCON,5)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x8C4);	// @ (0x118 * 8 + 4)
#define                                 DAC1OE2_bit         _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// DAC1CON1<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1CON1,5)
// DAC1CON1<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1CON1,6)
// DAC1CON1<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1CON1,7)
// DAC2CON0<DAC2EN>
extern volatile __bit                   DAC2EN              __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 DAC2EN_bit          _BIT_ACCESS(DAC2CON0,7)
// DAC2CON0<DAC2OE1>
extern volatile __bit                   DAC2OE1             __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 DAC2OE1_bit         _BIT_ACCESS(DAC2CON0,5)
// DAC2CON0<DAC2OE2>
extern volatile __bit                   DAC2OE2             __at(0x2C8C);	// @ (0x591 * 8 + 4)
#define                                 DAC2OE2_bit         _BIT_ACCESS(DAC2CON0,4)
// DAC3CON0<DAC3EN>
extern volatile __bit                   DAC3EN              __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC3EN_bit          _BIT_ACCESS(DAC3CON0,7)
// DAC3CON0<DAC3OE1>
extern volatile __bit                   DAC3OE1             __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC3OE1_bit         _BIT_ACCESS(DAC3CON0,5)
// DAC3CON0<DAC3OE2>
extern volatile __bit                   DAC3OE2             __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC3OE2_bit         _BIT_ACCESS(DAC3CON0,4)
// DAC4CON0<DAC4EN>
extern volatile __bit                   DAC4EN              __at(0x2CAF);	// @ (0x595 * 8 + 7)
#define                                 DAC4EN_bit          _BIT_ACCESS(DAC4CON0,7)
// DAC4CON0<DAC4OE1>
extern volatile __bit                   DAC4OE1             __at(0x2CAD);	// @ (0x595 * 8 + 5)
#define                                 DAC4OE1_bit         _BIT_ACCESS(DAC4CON0,5)
// DAC4CON0<DAC4OE2>
extern volatile __bit                   DAC4OE2             __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 DAC4OE2_bit         _BIT_ACCESS(DAC4CON0,4)
// DAC1CON0<DACEN>
extern volatile __bit                   DACEN               __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 DACEN_bit           _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DACNSS>
extern volatile __bit                   DACNSS              __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 DACNSS_bit          _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DACOE0>
extern volatile __bit                   DACOE0              __at(0x8C4);	// @ (0x118 * 8 + 4)
#define                                 DACOE0_bit          _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DACOE1>
extern volatile __bit                   DACOE1              __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 DACOE1_bit          _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DACPSS0>
extern volatile __bit                   DACPSS0             __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 DACPSS0_bit         _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DACPSS1>
extern volatile __bit                   DACPSS1             __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 DACPSS1_bit         _BIT_ACCESS(DAC1CON0,3)
// DAC1CON1<DACR0>
extern volatile __bit                   DACR0               __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 DACR0_bit           _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DACR1>
extern volatile __bit                   DACR1               __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 DACR1_bit           _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DACR2>
extern volatile __bit                   DACR2               __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 DACR2_bit           _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DACR3>
extern volatile __bit                   DACR3               __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 DACR3_bit           _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DACR4>
extern volatile __bit                   DACR4               __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 DACR4_bit           _BIT_ACCESS(DAC1CON1,4)
// DAC1CON1<DACR5>
extern volatile __bit                   DACR5               __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 DACR5_bit           _BIT_ACCESS(DAC1CON1,5)
// DAC1CON1<DACR6>
extern volatile __bit                   DACR6               __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 DACR6_bit           _BIT_ACCESS(DAC1CON1,6)
// DAC1CON1<DACR7>
extern volatile __bit                   DACR7               __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 DACR7_bit           _BIT_ACCESS(DAC1CON1,7)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x14D5);	// @ (0x29A * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// CCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x189C);	// @ (0x313 * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(CCP3CON,4)
// CCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x189D);	// @ (0x313 * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(CCP3CON,5)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x10A5);	// @ (0x214 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// PIE2<EEIE>
extern volatile __bit                   EEIE                __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 EEIE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<EEIF>
extern volatile __bit                   EEIF                __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 EEIF_bit            _BIT_ACCESS(PIR2,4)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0xCAF);	// @ (0x195 * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// EECON1<FREE>
