MikroElektronika/core_packages/PIC/XC8/def/PIC16F1788/mcu.h
extern volatile __bit                   LATA5               __at(0x865);	// @ (0x10C * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x866);	// @ (0x10C * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x867);	// @ (0x10C * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x868);	// @ (0x10D * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x869);	// @ (0x10D * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x86A);	// @ (0x10D * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x86B);	// @ (0x10D * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x86C);	// @ (0x10D * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x86D);	// @ (0x10D * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x86E);	// @ (0x10D * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x86F);	// @ (0x10D * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x870);	// @ (0x10E * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x871);	// @ (0x10E * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x872);	// @ (0x10E * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x876);	// @ (0x10E * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x877);	// @ (0x10E * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// EECON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(EECON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// CMOUT<MC3OUT>
extern volatile __bit                   MC3OUT              __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 MC3OUT_bit          _BIT_ACCESS(CMOUT,2)
// CMOUT<MC4OUT>
extern volatile __bit                   MC4OUT              __at(0x8AB);	// @ (0x115 * 8 + 3)
#define                                 MC4OUT_bit          _BIT_ACCESS(CMOUT,3)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// ODCONA<ODCONA0>
extern volatile __bit                   ODCONA0             __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODCONA0_bit         _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCONA1>
extern volatile __bit                   ODCONA1             __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODCONA1_bit         _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCONA2>
extern volatile __bit                   ODCONA2             __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODCONA2_bit         _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCONA3>
extern volatile __bit                   ODCONA3             __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 ODCONA3_bit         _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCONA4>
extern volatile __bit                   ODCONA4             __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODCONA4_bit         _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCONA5>
extern volatile __bit                   ODCONA5             __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODCONA5_bit         _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCONA6>
extern volatile __bit                   ODCONA6             __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 ODCONA6_bit         _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCONA7>
extern volatile __bit                   ODCONA7             __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 ODCONA7_bit         _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCONB0>
extern volatile __bit                   ODCONB0             __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 ODCONB0_bit         _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCONB1>
extern volatile __bit                   ODCONB1             __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 ODCONB1_bit         _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCONB2>
extern volatile __bit                   ODCONB2             __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 ODCONB2_bit         _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCONB3>
extern volatile __bit                   ODCONB3             __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 ODCONB3_bit         _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCONB4>
extern volatile __bit                   ODCONB4             __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODCONB4_bit         _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCONB5>
extern volatile __bit                   ODCONB5             __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODCONB5_bit         _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCONB6>
extern volatile __bit                   ODCONB6             __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODCONB6_bit         _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCONB7>
extern volatile __bit                   ODCONB7             __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODCONB7_bit         _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCONC0>
extern volatile __bit                   ODCONC0             __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODCONC0_bit         _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCONC1>
extern volatile __bit                   ODCONC1             __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODCONC1_bit         _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCONC2>
extern volatile __bit                   ODCONC2             __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODCONC2_bit         _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCONC3>
extern volatile __bit                   ODCONC3             __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODCONC3_bit         _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCONC4>
extern volatile __bit                   ODCONC4             __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODCONC4_bit         _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCONC5>
extern volatile __bit                   ODCONC5             __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODCONC5_bit         _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCONC6>
extern volatile __bit                   ODCONC6             __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODCONC6_bit         _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCONC7>
extern volatile __bit                   ODCONC7             __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODCONC7_bit         _BIT_ACCESS(ODCONC,7)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1PCH2>
extern volatile __bit                   OPA1PCH2            __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 OPA1PCH2_bit        _BIT_ACCESS(OPA1CON,2)
// OPA1CON<OPA1SP>
extern volatile __bit                   OPA1SP              __at(0x288E);	// @ (0x511 * 8 + 6)
#define                                 OPA1SP_bit          _BIT_ACCESS(OPA1CON,6)
// OPA2CON<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x289F);	// @ (0x513 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON,7)
// OPA2CON<OPA2PCH0>
extern volatile __bit                   OPA2PCH0            __at(0x2898);	// @ (0x513 * 8 + 0)
#define                                 OPA2PCH0_bit        _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2PCH1>
extern volatile __bit                   OPA2PCH1            __at(0x2899);	// @ (0x513 * 8 + 1)
#define                                 OPA2PCH1_bit        _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2PCH2>
extern volatile __bit                   OPA2PCH2            __at(0x289A);	// @ (0x513 * 8 + 2)
#define                                 OPA2PCH2_bit        _BIT_ACCESS(OPA2CON,2)
// OPA2CON<OPA2SP>
extern volatile __bit                   OPA2SP              __at(0x289E);	// @ (0x513 * 8 + 6)
#define                                 OPA2SP_bit          _BIT_ACCESS(OPA2CON,6)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// PSMC1ASDC<P1ARSEN>
extern volatile __bit                   P1ARSEN             __at(0x74ED);	// @ (0xE9D * 8 + 5)
#define                                 P1ARSEN_bit         _BIT_ACCESS(PSMC1ASDC,5)
// PSMC1ASDC<P1ASDEN>
extern volatile __bit                   P1ASDEN             __at(0x74EE);	// @ (0xE9D * 8 + 6)
#define                                 P1ASDEN_bit         _BIT_ACCESS(PSMC1ASDC,6)
// PSMC1ASDL<P1ASDLA>
extern volatile __bit                   P1ASDLA             __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 P1ASDLA_bit         _BIT_ACCESS(PSMC1ASDL,0)
// PSMC1ASDL<P1ASDLB>
extern volatile __bit                   P1ASDLB             __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 P1ASDLB_bit         _BIT_ACCESS(PSMC1ASDL,1)
// PSMC1ASDL<P1ASDLC>
extern volatile __bit                   P1ASDLC             __at(0x74F2);	// @ (0xE9E * 8 + 2)
#define                                 P1ASDLC_bit         _BIT_ACCESS(PSMC1ASDL,2)
// PSMC1ASDL<P1ASDLD>
extern volatile __bit                   P1ASDLD             __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 P1ASDLD_bit         _BIT_ACCESS(PSMC1ASDL,3)
// PSMC1ASDL<P1ASDLE>
extern volatile __bit                   P1ASDLE             __at(0x74F4);	// @ (0xE9E * 8 + 4)
#define                                 P1ASDLE_bit         _BIT_ACCESS(PSMC1ASDL,4)
// PSMC1ASDL<P1ASDLF>
extern volatile __bit                   P1ASDLF             __at(0x74F5);	// @ (0xE9E * 8 + 5)
#define                                 P1ASDLF_bit         _BIT_ACCESS(PSMC1ASDL,5)
// PSMC1ASDC<P1ASDOV>
extern volatile __bit                   P1ASDOV             __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 P1ASDOV_bit         _BIT_ACCESS(PSMC1ASDC,0)
// PSMC1ASDS<P1ASDSC1>
extern volatile __bit                   P1ASDSC1            __at(0x74F9);	// @ (0xE9F * 8 + 1)
#define                                 P1ASDSC1_bit        _BIT_ACCESS(PSMC1ASDS,1)
// PSMC1ASDS<P1ASDSC2>
extern volatile __bit                   P1ASDSC2            __at(0x74FA);	// @ (0xE9F * 8 + 2)
#define                                 P1ASDSC2_bit        _BIT_ACCESS(PSMC1ASDS,2)
// PSMC1ASDS<P1ASDSC3>
extern volatile __bit                   P1ASDSC3            __at(0x74FB);	// @ (0xE9F * 8 + 3)
#define                                 P1ASDSC3_bit        _BIT_ACCESS(PSMC1ASDS,3)
// PSMC1ASDS<P1ASDSC4>
extern volatile __bit                   P1ASDSC4            __at(0x74FC);	// @ (0xE9F * 8 + 4)
#define                                 P1ASDSC4_bit        _BIT_ACCESS(PSMC1ASDS,4)
// PSMC1ASDS<P1ASDSIN>
extern volatile __bit                   P1ASDSIN            __at(0x74FF);	// @ (0xE9F * 8 + 7)
#define                                 P1ASDSIN_bit        _BIT_ACCESS(PSMC1ASDS,7)
// PSMC1ASDC<P1ASE>
extern volatile __bit                   P1ASE               __at(0x74EF);	// @ (0xE9D * 8 + 7)
#define                                 P1ASE_bit           _BIT_ACCESS(PSMC1ASDC,7)
// PSMC1CLK<P1CPRE0>
extern volatile __bit                   P1CPRE0             __at(0x74A4);	// @ (0xE94 * 8 + 4)
#define                                 P1CPRE0_bit         _BIT_ACCESS(PSMC1CLK,4)
// PSMC1CLK<P1CPRE1>
extern volatile __bit                   P1CPRE1             __at(0x74A5);	// @ (0xE94 * 8 + 5)
#define                                 P1CPRE1_bit         _BIT_ACCESS(PSMC1CLK,5)
// PSMC1CLK<P1CSRC0>
extern volatile __bit                   P1CSRC0             __at(0x74A0);	// @ (0xE94 * 8 + 0)
#define                                 P1CSRC0_bit         _BIT_ACCESS(PSMC1CLK,0)
// PSMC1CLK<P1CSRC1>
extern volatile __bit                   P1CSRC1             __at(0x74A1);	// @ (0xE94 * 8 + 1)
#define                                 P1CSRC1_bit         _BIT_ACCESS(PSMC1CLK,1)
// PSMC1CON<P1DBFE>
extern volatile __bit                   P1DBFE              __at(0x748D);	// @ (0xE91 * 8 + 5)
#define                                 P1DBFE_bit          _BIT_ACCESS(PSMC1CON,5)
// PSMC1CON<P1DBRE>
extern volatile __bit                   P1DBRE              __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 P1DBRE_bit          _BIT_ACCESS(PSMC1CON,4)
// PSMC1SYNC<P1DCPOL>
extern volatile __bit                   P1DCPOL             __at(0x749D);	// @ (0xE93 * 8 + 5)
#define                                 P1DCPOL_bit         _BIT_ACCESS(PSMC1SYNC,5)
// PSMC1DCS<P1DCSC1>
extern volatile __bit                   P1DCSC1             __at(0x74D9);	// @ (0xE9B * 8 + 1)
#define                                 P1DCSC1_bit         _BIT_ACCESS(PSMC1DCS,1)
// PSMC1DCS<P1DCSC2>
extern volatile __bit                   P1DCSC2             __at(0x74DA);	// @ (0xE9B * 8 + 2)
#define                                 P1DCSC2_bit         _BIT_ACCESS(PSMC1DCS,2)
// PSMC1DCS<P1DCSC3>
extern volatile __bit                   P1DCSC3             __at(0x74DB);	// @ (0xE9B * 8 + 3)
#define                                 P1DCSC3_bit         _BIT_ACCESS(PSMC1DCS,3)
// PSMC1DCS<P1DCSC4>
extern volatile __bit                   P1DCSC4             __at(0x74DC);	// @ (0xE9B * 8 + 4)
#define                                 P1DCSC4_bit         _BIT_ACCESS(PSMC1DCS,4)
// PSMC1DCS<P1DCSIN>
extern volatile __bit                   P1DCSIN             __at(0x74DF);	// @ (0xE9B * 8 + 7)
#define                                 P1DCSIN_bit         _BIT_ACCESS(PSMC1DCS,7)
// PSMC1DCS<P1DCST>
extern volatile __bit                   P1DCST              __at(0x74D8);	// @ (0xE9B * 8 + 0)
#define                                 P1DCST_bit          _BIT_ACCESS(PSMC1DCS,0)
// PSMC1BLNK<P1FEBM0>
extern volatile __bit                   P1FEBM0             __at(0x74BC);	// @ (0xE97 * 8 + 4)
#define                                 P1FEBM0_bit         _BIT_ACCESS(PSMC1BLNK,4)
// PSMC1BLNK<P1FEBM1>
extern volatile __bit                   P1FEBM1             __at(0x74BD);	// @ (0xE97 * 8 + 5)
#define                                 P1FEBM1_bit         _BIT_ACCESS(PSMC1BLNK,5)
// PSMC1FEBS<P1FEBSC1>
extern volatile __bit                   P1FEBSC1            __at(0x74C9);	// @ (0xE99 * 8 + 1)
#define                                 P1FEBSC1_bit        _BIT_ACCESS(PSMC1FEBS,1)
// PSMC1FEBS<P1FEBSC2>
extern volatile __bit                   P1FEBSC2            __at(0x74CA);	// @ (0xE99 * 8 + 2)
#define                                 P1FEBSC2_bit        _BIT_ACCESS(PSMC1FEBS,2)
// PSMC1FEBS<P1FEBSC3>
extern volatile __bit                   P1FEBSC3            __at(0x74CB);	// @ (0xE99 * 8 + 3)
#define                                 P1FEBSC3_bit        _BIT_ACCESS(PSMC1FEBS,3)
// PSMC1FEBS<P1FEBSC4>
extern volatile __bit                   P1FEBSC4            __at(0x74CC);	// @ (0xE99 * 8 + 4)
#define                                 P1FEBSC4_bit        _BIT_ACCESS(PSMC1FEBS,4)
// PSMC1FEBS<P1FEBSIN>
extern volatile __bit                   P1FEBSIN            __at(0x74CF);	// @ (0xE99 * 8 + 7)
#define                                 P1FEBSIN_bit        _BIT_ACCESS(PSMC1FEBS,7)
// PSMC1STR1<P1HSMEN>
extern volatile __bit                   P1HSMEN             __at(0x7578);	// @ (0xEAF * 8 + 0)
#define                                 P1HSMEN_bit         _BIT_ACCESS(PSMC1STR1,0)
// PSMC1POL<P1INPOL>
extern volatile __bit                   P1INPOL             __at(0x74B6);	// @ (0xE96 * 8 + 6)
#define                                 P1INPOL_bit         _BIT_ACCESS(PSMC1POL,6)
// PSMC1STR1<P1LSMEN>
extern volatile __bit                   P1LSMEN             __at(0x7579);	// @ (0xEAF * 8 + 1)
#define                                 P1LSMEN_bit         _BIT_ACCESS(PSMC1STR1,1)
// PSMC1MDL<P1MDLBIT>
extern volatile __bit                   P1MDLBIT            __at(0x7495);	// @ (0xE92 * 8 + 5)
#define                                 P1MDLBIT_bit        _BIT_ACCESS(PSMC1MDL,5)
// PSMC1MDL<P1MDLEN>
extern volatile __bit                   P1MDLEN             __at(0x7497);	// @ (0xE92 * 8 + 7)
#define                                 P1MDLEN_bit         _BIT_ACCESS(PSMC1MDL,7)
// PSMC1MDL<P1MDLPOL>
extern volatile __bit                   P1MDLPOL            __at(0x7496);	// @ (0xE92 * 8 + 6)
#define                                 P1MDLPOL_bit        _BIT_ACCESS(PSMC1MDL,6)
// PSMC1CON<P1MODE0>
extern volatile __bit                   P1MODE0             __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 P1MODE0_bit         _BIT_ACCESS(PSMC1CON,0)
// PSMC1CON<P1MODE1>
extern volatile __bit                   P1MODE1             __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 P1MODE1_bit         _BIT_ACCESS(PSMC1CON,1)
// PSMC1CON<P1MODE2>
extern volatile __bit                   P1MODE2             __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 P1MODE2_bit         _BIT_ACCESS(PSMC1CON,2)
// PSMC1CON<P1MODE3>
extern volatile __bit                   P1MODE3             __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 P1MODE3_bit         _BIT_ACCESS(PSMC1CON,3)
// PSMC1MDL<P1MSRC0>
extern volatile __bit                   P1MSRC0             __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 P1MSRC0_bit         _BIT_ACCESS(PSMC1MDL,0)
// PSMC1MDL<P1MSRC1>
extern volatile __bit                   P1MSRC1             __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 P1MSRC1_bit         _BIT_ACCESS(PSMC1MDL,1)
// PSMC1MDL<P1MSRC2>
extern volatile __bit                   P1MSRC2             __at(0x7492);	// @ (0xE92 * 8 + 2)
#define                                 P1MSRC2_bit         _BIT_ACCESS(PSMC1MDL,2)
// PSMC1MDL<P1MSRC3>
extern volatile __bit                   P1MSRC3             __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 P1MSRC3_bit         _BIT_ACCESS(PSMC1MDL,3)
// PSMC1OEN<P1OEA>
extern volatile __bit                   P1OEA               __at(0x74A8);	// @ (0xE95 * 8 + 0)
#define                                 P1OEA_bit           _BIT_ACCESS(PSMC1OEN,0)
