MikroElektronika/core_packages/PIC/XC8/def/PIC16F1788/mcu.h
extern volatile __bit                   PSMC1DC9            __at(0x7521);	// @ (0xEA4 * 8 + 1)
#define                                 PSMC1DC9_bit        _BIT_ACCESS(PSMC1DCH,1)
// PSMC1CON<PSMC1EN>
extern volatile __bit                   PSMC1EN             __at(0x748F);	// @ (0xE91 * 8 + 7)
#define                                 PSMC1EN_bit         _BIT_ACCESS(PSMC1CON,7)
// PSMC1FFA<PSMC1FFA0>
extern volatile __bit                   PSMC1FFA0           __at(0x7568);	// @ (0xEAD * 8 + 0)
#define                                 PSMC1FFA0_bit       _BIT_ACCESS(PSMC1FFA,0)
// PSMC1FFA<PSMC1FFA1>
extern volatile __bit                   PSMC1FFA1           __at(0x7569);	// @ (0xEAD * 8 + 1)
#define                                 PSMC1FFA1_bit       _BIT_ACCESS(PSMC1FFA,1)
// PSMC1FFA<PSMC1FFA2>
extern volatile __bit                   PSMC1FFA2           __at(0x756A);	// @ (0xEAD * 8 + 2)
#define                                 PSMC1FFA2_bit       _BIT_ACCESS(PSMC1FFA,2)
// PSMC1FFA<PSMC1FFA3>
extern volatile __bit                   PSMC1FFA3           __at(0x756B);	// @ (0xEAD * 8 + 3)
#define                                 PSMC1FFA3_bit       _BIT_ACCESS(PSMC1FFA,3)
// PSMC1CON<PSMC1LD>
extern volatile __bit                   PSMC1LD             __at(0x748E);	// @ (0xE91 * 8 + 6)
#define                                 PSMC1LD_bit         _BIT_ACCESS(PSMC1CON,6)
// PSMC1PHL<PSMC1PH0>
extern volatile __bit                   PSMC1PH0            __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 PSMC1PH0_bit        _BIT_ACCESS(PSMC1PHL,0)
// PSMC1PHL<PSMC1PH1>
extern volatile __bit                   PSMC1PH1            __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 PSMC1PH1_bit        _BIT_ACCESS(PSMC1PHL,1)
// PSMC1PHH<PSMC1PH10>
extern volatile __bit                   PSMC1PH10           __at(0x7512);	// @ (0xEA2 * 8 + 2)
#define                                 PSMC1PH10_bit       _BIT_ACCESS(PSMC1PHH,2)
// PSMC1PHH<PSMC1PH11>
extern volatile __bit                   PSMC1PH11           __at(0x7513);	// @ (0xEA2 * 8 + 3)
#define                                 PSMC1PH11_bit       _BIT_ACCESS(PSMC1PHH,3)
// PSMC1PHH<PSMC1PH12>
extern volatile __bit                   PSMC1PH12           __at(0x7514);	// @ (0xEA2 * 8 + 4)
#define                                 PSMC1PH12_bit       _BIT_ACCESS(PSMC1PHH,4)
// PSMC1PHH<PSMC1PH13>
extern volatile __bit                   PSMC1PH13           __at(0x7515);	// @ (0xEA2 * 8 + 5)
#define                                 PSMC1PH13_bit       _BIT_ACCESS(PSMC1PHH,5)
// PSMC1PHH<PSMC1PH14>
extern volatile __bit                   PSMC1PH14           __at(0x7516);	// @ (0xEA2 * 8 + 6)
#define                                 PSMC1PH14_bit       _BIT_ACCESS(PSMC1PHH,6)
// PSMC1PHH<PSMC1PH15>
extern volatile __bit                   PSMC1PH15           __at(0x7517);	// @ (0xEA2 * 8 + 7)
#define                                 PSMC1PH15_bit       _BIT_ACCESS(PSMC1PHH,7)
// PSMC1PHL<PSMC1PH2>
extern volatile __bit                   PSMC1PH2            __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 PSMC1PH2_bit        _BIT_ACCESS(PSMC1PHL,2)
// PSMC1PHL<PSMC1PH3>
extern volatile __bit                   PSMC1PH3            __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 PSMC1PH3_bit        _BIT_ACCESS(PSMC1PHL,3)
// PSMC1PHL<PSMC1PH4>
extern volatile __bit                   PSMC1PH4            __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 PSMC1PH4_bit        _BIT_ACCESS(PSMC1PHL,4)
// PSMC1PHL<PSMC1PH5>
extern volatile __bit                   PSMC1PH5            __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 PSMC1PH5_bit        _BIT_ACCESS(PSMC1PHL,5)
// PSMC1PHL<PSMC1PH6>
extern volatile __bit                   PSMC1PH6            __at(0x750E);	// @ (0xEA1 * 8 + 6)
#define                                 PSMC1PH6_bit        _BIT_ACCESS(PSMC1PHL,6)
// PSMC1PHL<PSMC1PH7>
extern volatile __bit                   PSMC1PH7            __at(0x750F);	// @ (0xEA1 * 8 + 7)
#define                                 PSMC1PH7_bit        _BIT_ACCESS(PSMC1PHL,7)
// PSMC1PHH<PSMC1PH8>
extern volatile __bit                   PSMC1PH8            __at(0x7510);	// @ (0xEA2 * 8 + 0)
#define                                 PSMC1PH8_bit        _BIT_ACCESS(PSMC1PHH,0)
// PSMC1PHH<PSMC1PH9>
extern volatile __bit                   PSMC1PH9            __at(0x7511);	// @ (0xEA2 * 8 + 1)
#define                                 PSMC1PH9_bit        _BIT_ACCESS(PSMC1PHH,1)
// PSMC1PRL<PSMC1PR0>
extern volatile __bit                   PSMC1PR0            __at(0x7528);	// @ (0xEA5 * 8 + 0)
#define                                 PSMC1PR0_bit        _BIT_ACCESS(PSMC1PRL,0)
// PSMC1PRL<PSMC1PR1>
extern volatile __bit                   PSMC1PR1            __at(0x7529);	// @ (0xEA5 * 8 + 1)
#define                                 PSMC1PR1_bit        _BIT_ACCESS(PSMC1PRL,1)
// PSMC1PRH<PSMC1PR10>
extern volatile __bit                   PSMC1PR10           __at(0x7532);	// @ (0xEA6 * 8 + 2)
#define                                 PSMC1PR10_bit       _BIT_ACCESS(PSMC1PRH,2)
// PSMC1PRH<PSMC1PR11>
extern volatile __bit                   PSMC1PR11           __at(0x7533);	// @ (0xEA6 * 8 + 3)
#define                                 PSMC1PR11_bit       _BIT_ACCESS(PSMC1PRH,3)
// PSMC1PRH<PSMC1PR12>
extern volatile __bit                   PSMC1PR12           __at(0x7534);	// @ (0xEA6 * 8 + 4)
#define                                 PSMC1PR12_bit       _BIT_ACCESS(PSMC1PRH,4)
// PSMC1PRH<PSMC1PR13>
extern volatile __bit                   PSMC1PR13           __at(0x7535);	// @ (0xEA6 * 8 + 5)
#define                                 PSMC1PR13_bit       _BIT_ACCESS(PSMC1PRH,5)
// PSMC1PRH<PSMC1PR14>
extern volatile __bit                   PSMC1PR14           __at(0x7536);	// @ (0xEA6 * 8 + 6)
#define                                 PSMC1PR14_bit       _BIT_ACCESS(PSMC1PRH,6)
// PSMC1PRH<PSMC1PR15>
extern volatile __bit                   PSMC1PR15           __at(0x7537);	// @ (0xEA6 * 8 + 7)
#define                                 PSMC1PR15_bit       _BIT_ACCESS(PSMC1PRH,7)
// PSMC1PRL<PSMC1PR2>
extern volatile __bit                   PSMC1PR2            __at(0x752A);	// @ (0xEA5 * 8 + 2)
#define                                 PSMC1PR2_bit        _BIT_ACCESS(PSMC1PRL,2)
// PSMC1PRL<PSMC1PR3>
extern volatile __bit                   PSMC1PR3            __at(0x752B);	// @ (0xEA5 * 8 + 3)
#define                                 PSMC1PR3_bit        _BIT_ACCESS(PSMC1PRL,3)
// PSMC1PRL<PSMC1PR4>
extern volatile __bit                   PSMC1PR4            __at(0x752C);	// @ (0xEA5 * 8 + 4)
#define                                 PSMC1PR4_bit        _BIT_ACCESS(PSMC1PRL,4)
// PSMC1PRL<PSMC1PR5>
extern volatile __bit                   PSMC1PR5            __at(0x752D);	// @ (0xEA5 * 8 + 5)
#define                                 PSMC1PR5_bit        _BIT_ACCESS(PSMC1PRL,5)
// PSMC1PRL<PSMC1PR6>
extern volatile __bit                   PSMC1PR6            __at(0x752E);	// @ (0xEA5 * 8 + 6)
#define                                 PSMC1PR6_bit        _BIT_ACCESS(PSMC1PRL,6)
// PSMC1PRL<PSMC1PR7>
extern volatile __bit                   PSMC1PR7            __at(0x752F);	// @ (0xEA5 * 8 + 7)
#define                                 PSMC1PR7_bit        _BIT_ACCESS(PSMC1PRL,7)
// PSMC1PRH<PSMC1PR8>
extern volatile __bit                   PSMC1PR8            __at(0x7530);	// @ (0xEA6 * 8 + 0)
#define                                 PSMC1PR8_bit        _BIT_ACCESS(PSMC1PRH,0)
// PSMC1PRH<PSMC1PR9>
extern volatile __bit                   PSMC1PR9            __at(0x7531);	// @ (0xEA6 * 8 + 1)
#define                                 PSMC1PR9_bit        _BIT_ACCESS(PSMC1PRH,1)
// PIE4<PSMC1SIE>
extern volatile __bit                   PSMC1SIE            __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 PSMC1SIE_bit        _BIT_ACCESS(PIE4,0)
// PIR4<PSMC1SIF>
extern volatile __bit                   PSMC1SIF            __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 PSMC1SIF_bit        _BIT_ACCESS(PIR4,0)
// PIE4<PSMC1TIE>
extern volatile __bit                   PSMC1TIE            __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 PSMC1TIE_bit        _BIT_ACCESS(PIE4,4)
// PIR4<PSMC1TIF>
extern volatile __bit                   PSMC1TIF            __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 PSMC1TIF_bit        _BIT_ACCESS(PIR4,4)
// PSMC1TMRL<PSMC1TMR0>
extern volatile __bit                   PSMC1TMR0           __at(0x7538);	// @ (0xEA7 * 8 + 0)
#define                                 PSMC1TMR0_bit       _BIT_ACCESS(PSMC1TMRL,0)
// PSMC1TMRL<PSMC1TMR1>
extern volatile __bit                   PSMC1TMR1           __at(0x7539);	// @ (0xEA7 * 8 + 1)
#define                                 PSMC1TMR1_bit       _BIT_ACCESS(PSMC1TMRL,1)
// PSMC1TMRH<PSMC1TMR10>
extern volatile __bit                   PSMC1TMR10          __at(0x7542);	// @ (0xEA8 * 8 + 2)
#define                                 PSMC1TMR10_bit      _BIT_ACCESS(PSMC1TMRH,2)
// PSMC1TMRH<PSMC1TMR11>
extern volatile __bit                   PSMC1TMR11          __at(0x7543);	// @ (0xEA8 * 8 + 3)
#define                                 PSMC1TMR11_bit      _BIT_ACCESS(PSMC1TMRH,3)
// PSMC1TMRH<PSMC1TMR12>
extern volatile __bit                   PSMC1TMR12          __at(0x7544);	// @ (0xEA8 * 8 + 4)
#define                                 PSMC1TMR12_bit      _BIT_ACCESS(PSMC1TMRH,4)
// PSMC1TMRH<PSMC1TMR13>
extern volatile __bit                   PSMC1TMR13          __at(0x7545);	// @ (0xEA8 * 8 + 5)
#define                                 PSMC1TMR13_bit      _BIT_ACCESS(PSMC1TMRH,5)
// PSMC1TMRH<PSMC1TMR14>
extern volatile __bit                   PSMC1TMR14          __at(0x7546);	// @ (0xEA8 * 8 + 6)
#define                                 PSMC1TMR14_bit      _BIT_ACCESS(PSMC1TMRH,6)
// PSMC1TMRH<PSMC1TMR15>
extern volatile __bit                   PSMC1TMR15          __at(0x7547);	// @ (0xEA8 * 8 + 7)
#define                                 PSMC1TMR15_bit      _BIT_ACCESS(PSMC1TMRH,7)
// PSMC1TMRL<PSMC1TMR2>
extern volatile __bit                   PSMC1TMR2           __at(0x753A);	// @ (0xEA7 * 8 + 2)
#define                                 PSMC1TMR2_bit       _BIT_ACCESS(PSMC1TMRL,2)
// PSMC1TMRL<PSMC1TMR3>
extern volatile __bit                   PSMC1TMR3           __at(0x753B);	// @ (0xEA7 * 8 + 3)
#define                                 PSMC1TMR3_bit       _BIT_ACCESS(PSMC1TMRL,3)
// PSMC1TMRL<PSMC1TMR4>
extern volatile __bit                   PSMC1TMR4           __at(0x753C);	// @ (0xEA7 * 8 + 4)
#define                                 PSMC1TMR4_bit       _BIT_ACCESS(PSMC1TMRL,4)
// PSMC1TMRL<PSMC1TMR5>
extern volatile __bit                   PSMC1TMR5           __at(0x753D);	// @ (0xEA7 * 8 + 5)
#define                                 PSMC1TMR5_bit       _BIT_ACCESS(PSMC1TMRL,5)
// PSMC1TMRL<PSMC1TMR6>
extern volatile __bit                   PSMC1TMR6           __at(0x753E);	// @ (0xEA7 * 8 + 6)
#define                                 PSMC1TMR6_bit       _BIT_ACCESS(PSMC1TMRL,6)
// PSMC1TMRL<PSMC1TMR7>
extern volatile __bit                   PSMC1TMR7           __at(0x753F);	// @ (0xEA7 * 8 + 7)
#define                                 PSMC1TMR7_bit       _BIT_ACCESS(PSMC1TMRL,7)
// PSMC1TMRH<PSMC1TMR8>
extern volatile __bit                   PSMC1TMR8           __at(0x7540);	// @ (0xEA8 * 8 + 0)
#define                                 PSMC1TMR8_bit       _BIT_ACCESS(PSMC1TMRH,0)
// PSMC1TMRH<PSMC1TMR9>
extern volatile __bit                   PSMC1TMR9           __at(0x7541);	// @ (0xEA8 * 8 + 1)
#define                                 PSMC1TMR9_bit       _BIT_ACCESS(PSMC1TMRH,1)
// PSMC2BLKF<PSMC2BLKF0>
extern volatile __bit                   PSMC2BLKF0          __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 PSMC2BLKF0_bit      _BIT_ACCESS(PSMC2BLKF,0)
// PSMC2BLKF<PSMC2BLKF1>
extern volatile __bit                   PSMC2BLKF1          __at(0x7661);	// @ (0xECC * 8 + 1)
#define                                 PSMC2BLKF1_bit      _BIT_ACCESS(PSMC2BLKF,1)
// PSMC2BLKF<PSMC2BLKF2>
extern volatile __bit                   PSMC2BLKF2          __at(0x7662);	// @ (0xECC * 8 + 2)
#define                                 PSMC2BLKF2_bit      _BIT_ACCESS(PSMC2BLKF,2)
// PSMC2BLKF<PSMC2BLKF3>
extern volatile __bit                   PSMC2BLKF3          __at(0x7663);	// @ (0xECC * 8 + 3)
#define                                 PSMC2BLKF3_bit      _BIT_ACCESS(PSMC2BLKF,3)
// PSMC2BLKF<PSMC2BLKF4>
extern volatile __bit                   PSMC2BLKF4          __at(0x7664);	// @ (0xECC * 8 + 4)
#define                                 PSMC2BLKF4_bit      _BIT_ACCESS(PSMC2BLKF,4)
// PSMC2BLKF<PSMC2BLKF5>
extern volatile __bit                   PSMC2BLKF5          __at(0x7665);	// @ (0xECC * 8 + 5)
#define                                 PSMC2BLKF5_bit      _BIT_ACCESS(PSMC2BLKF,5)
// PSMC2BLKF<PSMC2BLKF6>
extern volatile __bit                   PSMC2BLKF6          __at(0x7666);	// @ (0xECC * 8 + 6)
#define                                 PSMC2BLKF6_bit      _BIT_ACCESS(PSMC2BLKF,6)
// PSMC2BLKF<PSMC2BLKF7>
extern volatile __bit                   PSMC2BLKF7          __at(0x7667);	// @ (0xECC * 8 + 7)
#define                                 PSMC2BLKF7_bit      _BIT_ACCESS(PSMC2BLKF,7)
// PSMC2BLKR<PSMC2BLKR0>
extern volatile __bit                   PSMC2BLKR0          __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 PSMC2BLKR0_bit      _BIT_ACCESS(PSMC2BLKR,0)
// PSMC2BLKR<PSMC2BLKR1>
extern volatile __bit                   PSMC2BLKR1          __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 PSMC2BLKR1_bit      _BIT_ACCESS(PSMC2BLKR,1)
// PSMC2BLKR<PSMC2BLKR2>
extern volatile __bit                   PSMC2BLKR2          __at(0x765A);	// @ (0xECB * 8 + 2)
#define                                 PSMC2BLKR2_bit      _BIT_ACCESS(PSMC2BLKR,2)
// PSMC2BLKR<PSMC2BLKR3>
extern volatile __bit                   PSMC2BLKR3          __at(0x765B);	// @ (0xECB * 8 + 3)
#define                                 PSMC2BLKR3_bit      _BIT_ACCESS(PSMC2BLKR,3)
// PSMC2BLKR<PSMC2BLKR4>
extern volatile __bit                   PSMC2BLKR4          __at(0x765C);	// @ (0xECB * 8 + 4)
#define                                 PSMC2BLKR4_bit      _BIT_ACCESS(PSMC2BLKR,4)
// PSMC2BLKR<PSMC2BLKR5>
extern volatile __bit                   PSMC2BLKR5          __at(0x765D);	// @ (0xECB * 8 + 5)
#define                                 PSMC2BLKR5_bit      _BIT_ACCESS(PSMC2BLKR,5)
// PSMC2BLKR<PSMC2BLKR6>
extern volatile __bit                   PSMC2BLKR6          __at(0x765E);	// @ (0xECB * 8 + 6)
#define                                 PSMC2BLKR6_bit      _BIT_ACCESS(PSMC2BLKR,6)
// PSMC2BLKR<PSMC2BLKR7>
extern volatile __bit                   PSMC2BLKR7          __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 PSMC2BLKR7_bit      _BIT_ACCESS(PSMC2BLKR,7)
// PSMC2DBF<PSMC2DBF0>
extern volatile __bit                   PSMC2DBF0           __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 PSMC2DBF0_bit       _BIT_ACCESS(PSMC2DBF,0)
// PSMC2DBF<PSMC2DBF1>
extern volatile __bit                   PSMC2DBF1           __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 PSMC2DBF1_bit       _BIT_ACCESS(PSMC2DBF,1)
// PSMC2DBF<PSMC2DBF2>
extern volatile __bit                   PSMC2DBF2           __at(0x7652);	// @ (0xECA * 8 + 2)
#define                                 PSMC2DBF2_bit       _BIT_ACCESS(PSMC2DBF,2)
// PSMC2DBF<PSMC2DBF3>
extern volatile __bit                   PSMC2DBF3           __at(0x7653);	// @ (0xECA * 8 + 3)
#define                                 PSMC2DBF3_bit       _BIT_ACCESS(PSMC2DBF,3)
// PSMC2DBF<PSMC2DBF4>
extern volatile __bit                   PSMC2DBF4           __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 PSMC2DBF4_bit       _BIT_ACCESS(PSMC2DBF,4)
// PSMC2DBF<PSMC2DBF5>
extern volatile __bit                   PSMC2DBF5           __at(0x7655);	// @ (0xECA * 8 + 5)
#define                                 PSMC2DBF5_bit       _BIT_ACCESS(PSMC2DBF,5)
// PSMC2DBF<PSMC2DBF6>
extern volatile __bit                   PSMC2DBF6           __at(0x7656);	// @ (0xECA * 8 + 6)
#define                                 PSMC2DBF6_bit       _BIT_ACCESS(PSMC2DBF,6)
// PSMC2DBF<PSMC2DBF7>
extern volatile __bit                   PSMC2DBF7           __at(0x7657);	// @ (0xECA * 8 + 7)
#define                                 PSMC2DBF7_bit       _BIT_ACCESS(PSMC2DBF,7)
// PSMC2DBR<PSMC2DBR0>
extern volatile __bit                   PSMC2DBR0           __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 PSMC2DBR0_bit       _BIT_ACCESS(PSMC2DBR,0)
// PSMC2DBR<PSMC2DBR1>
extern volatile __bit                   PSMC2DBR1           __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 PSMC2DBR1_bit       _BIT_ACCESS(PSMC2DBR,1)
// PSMC2DBR<PSMC2DBR2>
extern volatile __bit                   PSMC2DBR2           __at(0x764A);	// @ (0xEC9 * 8 + 2)
#define                                 PSMC2DBR2_bit       _BIT_ACCESS(PSMC2DBR,2)
// PSMC2DBR<PSMC2DBR3>
extern volatile __bit                   PSMC2DBR3           __at(0x764B);	// @ (0xEC9 * 8 + 3)
#define                                 PSMC2DBR3_bit       _BIT_ACCESS(PSMC2DBR,3)
// PSMC2DBR<PSMC2DBR4>
extern volatile __bit                   PSMC2DBR4           __at(0x764C);	// @ (0xEC9 * 8 + 4)
#define                                 PSMC2DBR4_bit       _BIT_ACCESS(PSMC2DBR,4)
// PSMC2DBR<PSMC2DBR5>
extern volatile __bit                   PSMC2DBR5           __at(0x764D);	// @ (0xEC9 * 8 + 5)
#define                                 PSMC2DBR5_bit       _BIT_ACCESS(PSMC2DBR,5)
// PSMC2DBR<PSMC2DBR6>
extern volatile __bit                   PSMC2DBR6           __at(0x764E);	// @ (0xEC9 * 8 + 6)
#define                                 PSMC2DBR6_bit       _BIT_ACCESS(PSMC2DBR,6)
// PSMC2DBR<PSMC2DBR7>
extern volatile __bit                   PSMC2DBR7           __at(0x764F);	// @ (0xEC9 * 8 + 7)
#define                                 PSMC2DBR7_bit       _BIT_ACCESS(PSMC2DBR,7)
// PSMC2DCL<PSMC2DC0>
extern volatile __bit                   PSMC2DC0            __at(0x7618);	// @ (0xEC3 * 8 + 0)
#define                                 PSMC2DC0_bit        _BIT_ACCESS(PSMC2DCL,0)
// PSMC2DCL<PSMC2DC1>
extern volatile __bit                   PSMC2DC1            __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 PSMC2DC1_bit        _BIT_ACCESS(PSMC2DCL,1)
// PSMC2DCH<PSMC2DC10>
extern volatile __bit                   PSMC2DC10           __at(0x7622);	// @ (0xEC4 * 8 + 2)
#define                                 PSMC2DC10_bit       _BIT_ACCESS(PSMC2DCH,2)
// PSMC2DCH<PSMC2DC11>
extern volatile __bit                   PSMC2DC11           __at(0x7623);	// @ (0xEC4 * 8 + 3)
#define                                 PSMC2DC11_bit       _BIT_ACCESS(PSMC2DCH,3)
// PSMC2DCH<PSMC2DC12>
extern volatile __bit                   PSMC2DC12           __at(0x7624);	// @ (0xEC4 * 8 + 4)
#define                                 PSMC2DC12_bit       _BIT_ACCESS(PSMC2DCH,4)
// PSMC2DCH<PSMC2DC13>
extern volatile __bit                   PSMC2DC13           __at(0x7625);	// @ (0xEC4 * 8 + 5)
#define                                 PSMC2DC13_bit       _BIT_ACCESS(PSMC2DCH,5)
// PSMC2DCH<PSMC2DC14>
extern volatile __bit                   PSMC2DC14           __at(0x7626);	// @ (0xEC4 * 8 + 6)
#define                                 PSMC2DC14_bit       _BIT_ACCESS(PSMC2DCH,6)
// PSMC2DCH<PSMC2DC15>
extern volatile __bit                   PSMC2DC15           __at(0x7627);	// @ (0xEC4 * 8 + 7)
#define                                 PSMC2DC15_bit       _BIT_ACCESS(PSMC2DCH,7)
// PSMC2DCL<PSMC2DC2>
extern volatile __bit                   PSMC2DC2            __at(0x761A);	// @ (0xEC3 * 8 + 2)
#define                                 PSMC2DC2_bit        _BIT_ACCESS(PSMC2DCL,2)
// PSMC2DCL<PSMC2DC3>
extern volatile __bit                   PSMC2DC3            __at(0x761B);	// @ (0xEC3 * 8 + 3)
#define                                 PSMC2DC3_bit        _BIT_ACCESS(PSMC2DCL,3)
// PSMC2DCL<PSMC2DC4>
extern volatile __bit                   PSMC2DC4            __at(0x761C);	// @ (0xEC3 * 8 + 4)
#define                                 PSMC2DC4_bit        _BIT_ACCESS(PSMC2DCL,4)
// PSMC2DCL<PSMC2DC5>
extern volatile __bit                   PSMC2DC5            __at(0x761D);	// @ (0xEC3 * 8 + 5)
#define                                 PSMC2DC5_bit        _BIT_ACCESS(PSMC2DCL,5)
// PSMC2DCL<PSMC2DC6>
extern volatile __bit                   PSMC2DC6            __at(0x761E);	// @ (0xEC3 * 8 + 6)
#define                                 PSMC2DC6_bit        _BIT_ACCESS(PSMC2DCL,6)
// PSMC2DCL<PSMC2DC7>
extern volatile __bit                   PSMC2DC7            __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 PSMC2DC7_bit        _BIT_ACCESS(PSMC2DCL,7)
// PSMC2DCH<PSMC2DC8>
extern volatile __bit                   PSMC2DC8            __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 PSMC2DC8_bit        _BIT_ACCESS(PSMC2DCH,0)
// PSMC2DCH<PSMC2DC9>
extern volatile __bit                   PSMC2DC9            __at(0x7621);	// @ (0xEC4 * 8 + 1)
#define                                 PSMC2DC9_bit        _BIT_ACCESS(PSMC2DCH,1)
// PSMC2CON<PSMC2EN>
extern volatile __bit                   PSMC2EN             __at(0x758F);	// @ (0xEB1 * 8 + 7)
#define                                 PSMC2EN_bit         _BIT_ACCESS(PSMC2CON,7)
// PSMC2FFA<PSMC2FFA0>
extern volatile __bit                   PSMC2FFA0           __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 PSMC2FFA0_bit       _BIT_ACCESS(PSMC2FFA,0)
// PSMC2FFA<PSMC2FFA1>
extern volatile __bit                   PSMC2FFA1           __at(0x7669);	// @ (0xECD * 8 + 1)
#define                                 PSMC2FFA1_bit       _BIT_ACCESS(PSMC2FFA,1)
// PSMC2FFA<PSMC2FFA2>
extern volatile __bit                   PSMC2FFA2           __at(0x766A);	// @ (0xECD * 8 + 2)
#define                                 PSMC2FFA2_bit       _BIT_ACCESS(PSMC2FFA,2)
// PSMC2FFA<PSMC2FFA3>
extern volatile __bit                   PSMC2FFA3           __at(0x766B);	// @ (0xECD * 8 + 3)
#define                                 PSMC2FFA3_bit       _BIT_ACCESS(PSMC2FFA,3)
// PSMC2CON<PSMC2LD>
extern volatile __bit                   PSMC2LD             __at(0x758E);	// @ (0xEB1 * 8 + 6)
#define                                 PSMC2LD_bit         _BIT_ACCESS(PSMC2CON,6)
// PSMC2PHL<PSMC2PH0>
extern volatile __bit                   PSMC2PH0            __at(0x7608);	// @ (0xEC1 * 8 + 0)
#define                                 PSMC2PH0_bit        _BIT_ACCESS(PSMC2PHL,0)
// PSMC2PHL<PSMC2PH1>
extern volatile __bit                   PSMC2PH1            __at(0x7609);	// @ (0xEC1 * 8 + 1)
#define                                 PSMC2PH1_bit        _BIT_ACCESS(PSMC2PHL,1)
// PSMC2PHH<PSMC2PH10>
extern volatile __bit                   PSMC2PH10           __at(0x7612);	// @ (0xEC2 * 8 + 2)
#define                                 PSMC2PH10_bit       _BIT_ACCESS(PSMC2PHH,2)
// PSMC2PHH<PSMC2PH11>
extern volatile __bit                   PSMC2PH11           __at(0x7613);	// @ (0xEC2 * 8 + 3)
#define                                 PSMC2PH11_bit       _BIT_ACCESS(PSMC2PHH,3)
// PSMC2PHH<PSMC2PH12>
extern volatile __bit                   PSMC2PH12           __at(0x7614);	// @ (0xEC2 * 8 + 4)
#define                                 PSMC2PH12_bit       _BIT_ACCESS(PSMC2PHH,4)
// PSMC2PHH<PSMC2PH13>
extern volatile __bit                   PSMC2PH13           __at(0x7615);	// @ (0xEC2 * 8 + 5)
