MikroElektronika/core_packages/PIC/XC8/def/PIC16F1788/mcu.h
extern volatile __bit                   PSMC3PR10           __at(0x7732);	// @ (0xEE6 * 8 + 2)
#define                                 PSMC3PR10_bit       _BIT_ACCESS(PSMC3PRH,2)
// PSMC3PRH<PSMC3PR11>
extern volatile __bit                   PSMC3PR11           __at(0x7733);	// @ (0xEE6 * 8 + 3)
#define                                 PSMC3PR11_bit       _BIT_ACCESS(PSMC3PRH,3)
// PSMC3PRH<PSMC3PR12>
extern volatile __bit                   PSMC3PR12           __at(0x7734);	// @ (0xEE6 * 8 + 4)
#define                                 PSMC3PR12_bit       _BIT_ACCESS(PSMC3PRH,4)
// PSMC3PRH<PSMC3PR13>
extern volatile __bit                   PSMC3PR13           __at(0x7735);	// @ (0xEE6 * 8 + 5)
#define                                 PSMC3PR13_bit       _BIT_ACCESS(PSMC3PRH,5)
// PSMC3PRH<PSMC3PR14>
extern volatile __bit                   PSMC3PR14           __at(0x7736);	// @ (0xEE6 * 8 + 6)
#define                                 PSMC3PR14_bit       _BIT_ACCESS(PSMC3PRH,6)
// PSMC3PRH<PSMC3PR15>
extern volatile __bit                   PSMC3PR15           __at(0x7737);	// @ (0xEE6 * 8 + 7)
#define                                 PSMC3PR15_bit       _BIT_ACCESS(PSMC3PRH,7)
// PSMC3PRL<PSMC3PR2>
extern volatile __bit                   PSMC3PR2            __at(0x772A);	// @ (0xEE5 * 8 + 2)
#define                                 PSMC3PR2_bit        _BIT_ACCESS(PSMC3PRL,2)
// PSMC3PRL<PSMC3PR3>
extern volatile __bit                   PSMC3PR3            __at(0x772B);	// @ (0xEE5 * 8 + 3)
#define                                 PSMC3PR3_bit        _BIT_ACCESS(PSMC3PRL,3)
// PSMC3PRL<PSMC3PR4>
extern volatile __bit                   PSMC3PR4            __at(0x772C);	// @ (0xEE5 * 8 + 4)
#define                                 PSMC3PR4_bit        _BIT_ACCESS(PSMC3PRL,4)
// PSMC3PRL<PSMC3PR5>
extern volatile __bit                   PSMC3PR5            __at(0x772D);	// @ (0xEE5 * 8 + 5)
#define                                 PSMC3PR5_bit        _BIT_ACCESS(PSMC3PRL,5)
// PSMC3PRL<PSMC3PR6>
extern volatile __bit                   PSMC3PR6            __at(0x772E);	// @ (0xEE5 * 8 + 6)
#define                                 PSMC3PR6_bit        _BIT_ACCESS(PSMC3PRL,6)
// PSMC3PRL<PSMC3PR7>
extern volatile __bit                   PSMC3PR7            __at(0x772F);	// @ (0xEE5 * 8 + 7)
#define                                 PSMC3PR7_bit        _BIT_ACCESS(PSMC3PRL,7)
// PSMC3PRH<PSMC3PR8>
extern volatile __bit                   PSMC3PR8            __at(0x7730);	// @ (0xEE6 * 8 + 0)
#define                                 PSMC3PR8_bit        _BIT_ACCESS(PSMC3PRH,0)
// PSMC3PRH<PSMC3PR9>
extern volatile __bit                   PSMC3PR9            __at(0x7731);	// @ (0xEE6 * 8 + 1)
#define                                 PSMC3PR9_bit        _BIT_ACCESS(PSMC3PRH,1)
// PIE4<PSMC3SIE>
extern volatile __bit                   PSMC3SIE            __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 PSMC3SIE_bit        _BIT_ACCESS(PIE4,2)
// PIR4<PSMC3SIF>
extern volatile __bit                   PSMC3SIF            __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 PSMC3SIF_bit        _BIT_ACCESS(PIR4,2)
// PIE4<PSMC3TIE>
extern volatile __bit                   PSMC3TIE            __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 PSMC3TIE_bit        _BIT_ACCESS(PIE4,6)
// PIR4<PSMC3TIF>
extern volatile __bit                   PSMC3TIF            __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 PSMC3TIF_bit        _BIT_ACCESS(PIR4,6)
// PSMC3TMRL<PSMC3TMR0>
extern volatile __bit                   PSMC3TMR0           __at(0x7738);	// @ (0xEE7 * 8 + 0)
#define                                 PSMC3TMR0_bit       _BIT_ACCESS(PSMC3TMRL,0)
// PSMC3TMRL<PSMC3TMR1>
extern volatile __bit                   PSMC3TMR1           __at(0x7739);	// @ (0xEE7 * 8 + 1)
#define                                 PSMC3TMR1_bit       _BIT_ACCESS(PSMC3TMRL,1)
// PSMC3TMRH<PSMC3TMR10>
extern volatile __bit                   PSMC3TMR10          __at(0x7742);	// @ (0xEE8 * 8 + 2)
#define                                 PSMC3TMR10_bit      _BIT_ACCESS(PSMC3TMRH,2)
// PSMC3TMRH<PSMC3TMR11>
extern volatile __bit                   PSMC3TMR11          __at(0x7743);	// @ (0xEE8 * 8 + 3)
#define                                 PSMC3TMR11_bit      _BIT_ACCESS(PSMC3TMRH,3)
// PSMC3TMRH<PSMC3TMR12>
extern volatile __bit                   PSMC3TMR12          __at(0x7744);	// @ (0xEE8 * 8 + 4)
#define                                 PSMC3TMR12_bit      _BIT_ACCESS(PSMC3TMRH,4)
// PSMC3TMRH<PSMC3TMR13>
extern volatile __bit                   PSMC3TMR13          __at(0x7745);	// @ (0xEE8 * 8 + 5)
#define                                 PSMC3TMR13_bit      _BIT_ACCESS(PSMC3TMRH,5)
// PSMC3TMRH<PSMC3TMR14>
extern volatile __bit                   PSMC3TMR14          __at(0x7746);	// @ (0xEE8 * 8 + 6)
#define                                 PSMC3TMR14_bit      _BIT_ACCESS(PSMC3TMRH,6)
// PSMC3TMRH<PSMC3TMR15>
extern volatile __bit                   PSMC3TMR15          __at(0x7747);	// @ (0xEE8 * 8 + 7)
#define                                 PSMC3TMR15_bit      _BIT_ACCESS(PSMC3TMRH,7)
// PSMC3TMRL<PSMC3TMR2>
extern volatile __bit                   PSMC3TMR2           __at(0x773A);	// @ (0xEE7 * 8 + 2)
#define                                 PSMC3TMR2_bit       _BIT_ACCESS(PSMC3TMRL,2)
// PSMC3TMRL<PSMC3TMR3>
extern volatile __bit                   PSMC3TMR3           __at(0x773B);	// @ (0xEE7 * 8 + 3)
#define                                 PSMC3TMR3_bit       _BIT_ACCESS(PSMC3TMRL,3)
// PSMC3TMRL<PSMC3TMR4>
extern volatile __bit                   PSMC3TMR4           __at(0x773C);	// @ (0xEE7 * 8 + 4)
#define                                 PSMC3TMR4_bit       _BIT_ACCESS(PSMC3TMRL,4)
// PSMC3TMRL<PSMC3TMR5>
extern volatile __bit                   PSMC3TMR5           __at(0x773D);	// @ (0xEE7 * 8 + 5)
#define                                 PSMC3TMR5_bit       _BIT_ACCESS(PSMC3TMRL,5)
// PSMC3TMRL<PSMC3TMR6>
extern volatile __bit                   PSMC3TMR6           __at(0x773E);	// @ (0xEE7 * 8 + 6)
#define                                 PSMC3TMR6_bit       _BIT_ACCESS(PSMC3TMRL,6)
// PSMC3TMRL<PSMC3TMR7>
extern volatile __bit                   PSMC3TMR7           __at(0x773F);	// @ (0xEE7 * 8 + 7)
#define                                 PSMC3TMR7_bit       _BIT_ACCESS(PSMC3TMRL,7)
// PSMC3TMRH<PSMC3TMR8>
extern volatile __bit                   PSMC3TMR8           __at(0x7740);	// @ (0xEE8 * 8 + 0)
#define                                 PSMC3TMR8_bit       _BIT_ACCESS(PSMC3TMRH,0)
// PSMC3TMRH<PSMC3TMR9>
extern volatile __bit                   PSMC3TMR9           __at(0x7741);	// @ (0xEE8 * 8 + 1)
#define                                 PSMC3TMR9_bit       _BIT_ACCESS(PSMC3TMRH,1)
// PSMC4BLKF<PSMC4BLKF0>
extern volatile __bit                   PSMC4BLKF0          __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 PSMC4BLKF0_bit      _BIT_ACCESS(PSMC4BLKF,0)
// PSMC4BLKF<PSMC4BLKF1>
extern volatile __bit                   PSMC4BLKF1          __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 PSMC4BLKF1_bit      _BIT_ACCESS(PSMC4BLKF,1)
// PSMC4BLKF<PSMC4BLKF2>
extern volatile __bit                   PSMC4BLKF2          __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 PSMC4BLKF2_bit      _BIT_ACCESS(PSMC4BLKF,2)
// PSMC4BLKF<PSMC4BLKF3>
extern volatile __bit                   PSMC4BLKF3          __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 PSMC4BLKF3_bit      _BIT_ACCESS(PSMC4BLKF,3)
// PSMC4BLKF<PSMC4BLKF4>
extern volatile __bit                   PSMC4BLKF4          __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 PSMC4BLKF4_bit      _BIT_ACCESS(PSMC4BLKF,4)
// PSMC4BLKF<PSMC4BLKF5>
extern volatile __bit                   PSMC4BLKF5          __at(0x7965);	// @ (0xF2C * 8 + 5)
#define                                 PSMC4BLKF5_bit      _BIT_ACCESS(PSMC4BLKF,5)
// PSMC4BLKF<PSMC4BLKF6>
extern volatile __bit                   PSMC4BLKF6          __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 PSMC4BLKF6_bit      _BIT_ACCESS(PSMC4BLKF,6)
// PSMC4BLKF<PSMC4BLKF7>
extern volatile __bit                   PSMC4BLKF7          __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 PSMC4BLKF7_bit      _BIT_ACCESS(PSMC4BLKF,7)
// PSMC4BLKR<PSMC4BLKR0>
extern volatile __bit                   PSMC4BLKR0          __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 PSMC4BLKR0_bit      _BIT_ACCESS(PSMC4BLKR,0)
// PSMC4BLKR<PSMC4BLKR1>
extern volatile __bit                   PSMC4BLKR1          __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 PSMC4BLKR1_bit      _BIT_ACCESS(PSMC4BLKR,1)
// PSMC4BLKR<PSMC4BLKR2>
extern volatile __bit                   PSMC4BLKR2          __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 PSMC4BLKR2_bit      _BIT_ACCESS(PSMC4BLKR,2)
// PSMC4BLKR<PSMC4BLKR3>
extern volatile __bit                   PSMC4BLKR3          __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 PSMC4BLKR3_bit      _BIT_ACCESS(PSMC4BLKR,3)
// PSMC4BLKR<PSMC4BLKR4>
extern volatile __bit                   PSMC4BLKR4          __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 PSMC4BLKR4_bit      _BIT_ACCESS(PSMC4BLKR,4)
// PSMC4BLKR<PSMC4BLKR5>
extern volatile __bit                   PSMC4BLKR5          __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 PSMC4BLKR5_bit      _BIT_ACCESS(PSMC4BLKR,5)
// PSMC4BLKR<PSMC4BLKR6>
extern volatile __bit                   PSMC4BLKR6          __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 PSMC4BLKR6_bit      _BIT_ACCESS(PSMC4BLKR,6)
// PSMC4BLKR<PSMC4BLKR7>
extern volatile __bit                   PSMC4BLKR7          __at(0x795F);	// @ (0xF2B * 8 + 7)
#define                                 PSMC4BLKR7_bit      _BIT_ACCESS(PSMC4BLKR,7)
// PSMC4DBF<PSMC4DBF0>
extern volatile __bit                   PSMC4DBF0           __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 PSMC4DBF0_bit       _BIT_ACCESS(PSMC4DBF,0)
// PSMC4DBF<PSMC4DBF1>
extern volatile __bit                   PSMC4DBF1           __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 PSMC4DBF1_bit       _BIT_ACCESS(PSMC4DBF,1)
// PSMC4DBF<PSMC4DBF2>
extern volatile __bit                   PSMC4DBF2           __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 PSMC4DBF2_bit       _BIT_ACCESS(PSMC4DBF,2)
// PSMC4DBF<PSMC4DBF3>
extern volatile __bit                   PSMC4DBF3           __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 PSMC4DBF3_bit       _BIT_ACCESS(PSMC4DBF,3)
// PSMC4DBF<PSMC4DBF4>
extern volatile __bit                   PSMC4DBF4           __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 PSMC4DBF4_bit       _BIT_ACCESS(PSMC4DBF,4)
// PSMC4DBF<PSMC4DBF5>
extern volatile __bit                   PSMC4DBF5           __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 PSMC4DBF5_bit       _BIT_ACCESS(PSMC4DBF,5)
// PSMC4DBF<PSMC4DBF6>
extern volatile __bit                   PSMC4DBF6           __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 PSMC4DBF6_bit       _BIT_ACCESS(PSMC4DBF,6)
// PSMC4DBF<PSMC4DBF7>
extern volatile __bit                   PSMC4DBF7           __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 PSMC4DBF7_bit       _BIT_ACCESS(PSMC4DBF,7)
// PSMC4DBR<PSMC4DBR0>
extern volatile __bit                   PSMC4DBR0           __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 PSMC4DBR0_bit       _BIT_ACCESS(PSMC4DBR,0)
// PSMC4DBR<PSMC4DBR1>
extern volatile __bit                   PSMC4DBR1           __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 PSMC4DBR1_bit       _BIT_ACCESS(PSMC4DBR,1)
// PSMC4DBR<PSMC4DBR2>
extern volatile __bit                   PSMC4DBR2           __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 PSMC4DBR2_bit       _BIT_ACCESS(PSMC4DBR,2)
// PSMC4DBR<PSMC4DBR3>
extern volatile __bit                   PSMC4DBR3           __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 PSMC4DBR3_bit       _BIT_ACCESS(PSMC4DBR,3)
// PSMC4DBR<PSMC4DBR4>
extern volatile __bit                   PSMC4DBR4           __at(0x794C);	// @ (0xF29 * 8 + 4)
#define                                 PSMC4DBR4_bit       _BIT_ACCESS(PSMC4DBR,4)
// PSMC4DBR<PSMC4DBR5>
extern volatile __bit                   PSMC4DBR5           __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 PSMC4DBR5_bit       _BIT_ACCESS(PSMC4DBR,5)
// PSMC4DBR<PSMC4DBR6>
extern volatile __bit                   PSMC4DBR6           __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 PSMC4DBR6_bit       _BIT_ACCESS(PSMC4DBR,6)
// PSMC4DBR<PSMC4DBR7>
extern volatile __bit                   PSMC4DBR7           __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 PSMC4DBR7_bit       _BIT_ACCESS(PSMC4DBR,7)
// PSMC4DCL<PSMC4DC0>
extern volatile __bit                   PSMC4DC0            __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 PSMC4DC0_bit        _BIT_ACCESS(PSMC4DCL,0)
// PSMC4DCL<PSMC4DC1>
extern volatile __bit                   PSMC4DC1            __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 PSMC4DC1_bit        _BIT_ACCESS(PSMC4DCL,1)
// PSMC4DCH<PSMC4DC10>
extern volatile __bit                   PSMC4DC10           __at(0x7922);	// @ (0xF24 * 8 + 2)
#define                                 PSMC4DC10_bit       _BIT_ACCESS(PSMC4DCH,2)
// PSMC4DCH<PSMC4DC11>
extern volatile __bit                   PSMC4DC11           __at(0x7923);	// @ (0xF24 * 8 + 3)
#define                                 PSMC4DC11_bit       _BIT_ACCESS(PSMC4DCH,3)
// PSMC4DCH<PSMC4DC12>
extern volatile __bit                   PSMC4DC12           __at(0x7924);	// @ (0xF24 * 8 + 4)
#define                                 PSMC4DC12_bit       _BIT_ACCESS(PSMC4DCH,4)
// PSMC4DCH<PSMC4DC13>
extern volatile __bit                   PSMC4DC13           __at(0x7925);	// @ (0xF24 * 8 + 5)
#define                                 PSMC4DC13_bit       _BIT_ACCESS(PSMC4DCH,5)
// PSMC4DCH<PSMC4DC14>
extern volatile __bit                   PSMC4DC14           __at(0x7926);	// @ (0xF24 * 8 + 6)
#define                                 PSMC4DC14_bit       _BIT_ACCESS(PSMC4DCH,6)
// PSMC4DCH<PSMC4DC15>
extern volatile __bit                   PSMC4DC15           __at(0x7927);	// @ (0xF24 * 8 + 7)
#define                                 PSMC4DC15_bit       _BIT_ACCESS(PSMC4DCH,7)
// PSMC4DCL<PSMC4DC2>
extern volatile __bit                   PSMC4DC2            __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 PSMC4DC2_bit        _BIT_ACCESS(PSMC4DCL,2)
// PSMC4DCL<PSMC4DC3>
extern volatile __bit                   PSMC4DC3            __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 PSMC4DC3_bit        _BIT_ACCESS(PSMC4DCL,3)
// PSMC4DCL<PSMC4DC4>
extern volatile __bit                   PSMC4DC4            __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 PSMC4DC4_bit        _BIT_ACCESS(PSMC4DCL,4)
// PSMC4DCL<PSMC4DC5>
extern volatile __bit                   PSMC4DC5            __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 PSMC4DC5_bit        _BIT_ACCESS(PSMC4DCL,5)
// PSMC4DCL<PSMC4DC6>
extern volatile __bit                   PSMC4DC6            __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 PSMC4DC6_bit        _BIT_ACCESS(PSMC4DCL,6)
// PSMC4DCL<PSMC4DC7>
extern volatile __bit                   PSMC4DC7            __at(0x791F);	// @ (0xF23 * 8 + 7)
#define                                 PSMC4DC7_bit        _BIT_ACCESS(PSMC4DCL,7)
// PSMC4DCH<PSMC4DC8>
extern volatile __bit                   PSMC4DC8            __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 PSMC4DC8_bit        _BIT_ACCESS(PSMC4DCH,0)
// PSMC4DCH<PSMC4DC9>
extern volatile __bit                   PSMC4DC9            __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 PSMC4DC9_bit        _BIT_ACCESS(PSMC4DCH,1)
// PSMC4CON<PSMC4EN>
extern volatile __bit                   PSMC4EN             __at(0x788F);	// @ (0xF11 * 8 + 7)
#define                                 PSMC4EN_bit         _BIT_ACCESS(PSMC4CON,7)
// PSMC4FFA<PSMC4FFA0>
extern volatile __bit                   PSMC4FFA0           __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 PSMC4FFA0_bit       _BIT_ACCESS(PSMC4FFA,0)
// PSMC4FFA<PSMC4FFA1>
extern volatile __bit                   PSMC4FFA1           __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 PSMC4FFA1_bit       _BIT_ACCESS(PSMC4FFA,1)
// PSMC4FFA<PSMC4FFA2>
extern volatile __bit                   PSMC4FFA2           __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 PSMC4FFA2_bit       _BIT_ACCESS(PSMC4FFA,2)
// PSMC4FFA<PSMC4FFA3>
extern volatile __bit                   PSMC4FFA3           __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 PSMC4FFA3_bit       _BIT_ACCESS(PSMC4FFA,3)
// PSMC4CON<PSMC4LD>
extern volatile __bit                   PSMC4LD             __at(0x788E);	// @ (0xF11 * 8 + 6)
#define                                 PSMC4LD_bit         _BIT_ACCESS(PSMC4CON,6)
// PSMC4PHL<PSMC4PH0>
extern volatile __bit                   PSMC4PH0            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 PSMC4PH0_bit        _BIT_ACCESS(PSMC4PHL,0)
// PSMC4PHL<PSMC4PH1>
extern volatile __bit                   PSMC4PH1            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 PSMC4PH1_bit        _BIT_ACCESS(PSMC4PHL,1)
// PSMC4PHH<PSMC4PH10>
extern volatile __bit                   PSMC4PH10           __at(0x7912);	// @ (0xF22 * 8 + 2)
#define                                 PSMC4PH10_bit       _BIT_ACCESS(PSMC4PHH,2)
// PSMC4PHH<PSMC4PH11>
extern volatile __bit                   PSMC4PH11           __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 PSMC4PH11_bit       _BIT_ACCESS(PSMC4PHH,3)
// PSMC4PHH<PSMC4PH12>
extern volatile __bit                   PSMC4PH12           __at(0x7914);	// @ (0xF22 * 8 + 4)
#define                                 PSMC4PH12_bit       _BIT_ACCESS(PSMC4PHH,4)
// PSMC4PHH<PSMC4PH13>
extern volatile __bit                   PSMC4PH13           __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 PSMC4PH13_bit       _BIT_ACCESS(PSMC4PHH,5)
// PSMC4PHH<PSMC4PH14>
extern volatile __bit                   PSMC4PH14           __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 PSMC4PH14_bit       _BIT_ACCESS(PSMC4PHH,6)
// PSMC4PHH<PSMC4PH15>
extern volatile __bit                   PSMC4PH15           __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 PSMC4PH15_bit       _BIT_ACCESS(PSMC4PHH,7)
// PSMC4PHL<PSMC4PH2>
extern volatile __bit                   PSMC4PH2            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 PSMC4PH2_bit        _BIT_ACCESS(PSMC4PHL,2)
// PSMC4PHL<PSMC4PH3>
extern volatile __bit                   PSMC4PH3            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 PSMC4PH3_bit        _BIT_ACCESS(PSMC4PHL,3)
// PSMC4PHL<PSMC4PH4>
extern volatile __bit                   PSMC4PH4            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 PSMC4PH4_bit        _BIT_ACCESS(PSMC4PHL,4)
// PSMC4PHL<PSMC4PH5>
extern volatile __bit                   PSMC4PH5            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 PSMC4PH5_bit        _BIT_ACCESS(PSMC4PHL,5)
// PSMC4PHL<PSMC4PH6>
extern volatile __bit                   PSMC4PH6            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 PSMC4PH6_bit        _BIT_ACCESS(PSMC4PHL,6)
// PSMC4PHL<PSMC4PH7>
extern volatile __bit                   PSMC4PH7            __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 PSMC4PH7_bit        _BIT_ACCESS(PSMC4PHL,7)
// PSMC4PHH<PSMC4PH8>
extern volatile __bit                   PSMC4PH8            __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 PSMC4PH8_bit        _BIT_ACCESS(PSMC4PHH,0)
// PSMC4PHH<PSMC4PH9>
extern volatile __bit                   PSMC4PH9            __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 PSMC4PH9_bit        _BIT_ACCESS(PSMC4PHH,1)
// PSMC4PRL<PSMC4PR0>
extern volatile __bit                   PSMC4PR0            __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 PSMC4PR0_bit        _BIT_ACCESS(PSMC4PRL,0)
// PSMC4PRL<PSMC4PR1>
extern volatile __bit                   PSMC4PR1            __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 PSMC4PR1_bit        _BIT_ACCESS(PSMC4PRL,1)
// PSMC4PRH<PSMC4PR10>
extern volatile __bit                   PSMC4PR10           __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 PSMC4PR10_bit       _BIT_ACCESS(PSMC4PRH,2)
// PSMC4PRH<PSMC4PR11>
extern volatile __bit                   PSMC4PR11           __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 PSMC4PR11_bit       _BIT_ACCESS(PSMC4PRH,3)
// PSMC4PRH<PSMC4PR12>
extern volatile __bit                   PSMC4PR12           __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 PSMC4PR12_bit       _BIT_ACCESS(PSMC4PRH,4)
// PSMC4PRH<PSMC4PR13>
extern volatile __bit                   PSMC4PR13           __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 PSMC4PR13_bit       _BIT_ACCESS(PSMC4PRH,5)
// PSMC4PRH<PSMC4PR14>
extern volatile __bit                   PSMC4PR14           __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 PSMC4PR14_bit       _BIT_ACCESS(PSMC4PRH,6)
// PSMC4PRH<PSMC4PR15>
extern volatile __bit                   PSMC4PR15           __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 PSMC4PR15_bit       _BIT_ACCESS(PSMC4PRH,7)
// PSMC4PRL<PSMC4PR2>
extern volatile __bit                   PSMC4PR2            __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 PSMC4PR2_bit        _BIT_ACCESS(PSMC4PRL,2)
// PSMC4PRL<PSMC4PR3>
extern volatile __bit                   PSMC4PR3            __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 PSMC4PR3_bit        _BIT_ACCESS(PSMC4PRL,3)
// PSMC4PRL<PSMC4PR4>
extern volatile __bit                   PSMC4PR4            __at(0x792C);	// @ (0xF25 * 8 + 4)
#define                                 PSMC4PR4_bit        _BIT_ACCESS(PSMC4PRL,4)
// PSMC4PRL<PSMC4PR5>
extern volatile __bit                   PSMC4PR5            __at(0x792D);	// @ (0xF25 * 8 + 5)
#define                                 PSMC4PR5_bit        _BIT_ACCESS(PSMC4PRL,5)
// PSMC4PRL<PSMC4PR6>
extern volatile __bit                   PSMC4PR6            __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 PSMC4PR6_bit        _BIT_ACCESS(PSMC4PRL,6)
// PSMC4PRL<PSMC4PR7>
extern volatile __bit                   PSMC4PR7            __at(0x792F);	// @ (0xF25 * 8 + 7)
#define                                 PSMC4PR7_bit        _BIT_ACCESS(PSMC4PRL,7)
// PSMC4PRH<PSMC4PR8>
extern volatile __bit                   PSMC4PR8            __at(0x7930);	// @ (0xF26 * 8 + 0)
